{"schema": [["dicom_patient_id", "str"], ["source_batch", "int"], ["tcia_id", "str"], ["path_report_biopsy", "str"], ["path_prostate_specimen", "str"], ["mri_report", "str"], ["treatment_", "str"]], "data": [{"dicom_patient_id": "ProstateDx-01-0001", "source_batch": 0, "tcia_id": "ProstateDx-01-0001", "path_report_biopsy": "", "path_prostate_specimen": "", "mri_report": "Prostate has a maximal lateral diameter of  5.2 cm, a maximal craniocaudal diameter of 3.6 cm and a maximal AP diameter of 2.8 cm resulting in an estimated gland volume of 27 cc. The zonal anatomy is preserved.     In the mid third of the prostate, in the anterior aspect of the right paramedian central gland, at 11 o'clock, there is a irregular 13 x 14 mm area of suspicious enhancement, suggestive for malignancy (series 701 slice location 27-36). On the T2-W images the mass abuts the fibromuscular band and there is asymmetric bulging. There is also suspicious enhancement beyond the deviated fibromuscular band in this location.  Beginning extraprostatic extension very likely. Series 501 slice location 33-36.    The peripheral zones show no evidence of malignancy. No evidence for involvement of the neurovascular bundle on either side. The seminal vesicles and show diffuse low signal on the  T2 weighted images; however the anatomy of the seminal vesicles with thin walls and regular vesicles seems to be preserved; there is no suspicious enhancement seen within the vesicles or within the walls. Therefore this T2 hypo intensity most likely caused by radiation. Seminal vesicles infiltration unlikely. No evidence of involvement of bladder neck and rectal wall.  No suspiciously enlarged obturator and iliac lymph nodes. IMPRESSION: 1) 1.4cm mass in the right anterior paramedian central gland, mid third of the prostate, as detailed above. Findings are highly suspicious for beginning extraprostatic extension (beyond the fibromuscular band) at 11 o'clock.  2) No evidence for involvement of the neurovascular bundle on either side.   3) No evidence of seminal vesicles infiltration.  4) No suspiciously enlarged obturator and iliac lymph nodes.", "treatment_": "No tissue report available, treatment history of androgen deprivation theraphy and radiation theraphy"}, {"dicom_patient_id": "ProstateDx-01-0002", "source_batch": 0, "tcia_id": "ProstateDx-01-0002", "path_report_biopsy": "Gross Description The specimen consists of multiple core fragments of tan soft tissue measuring 0.3cm to 1.8cm in length and 0.1cm in diameter.  The specimen is submitted in six cassettes.1-right pz, 2-right pz/tz, 3-right apex, 4-left pz, 5-left pz/tz, 6-left apex. PROSTATE 1.  RIGHT PZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 4+3=7/10, INVOLVING TWO OF TWO CORES AND 20% OF TOTAL TISSUE. PERINEURAL INVASION SEEN. 2.  RIGHT PZ/TZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 4+3=7/10, INVOLVING TWO OF TWO CORES AND 90% OF TOTAL TISSUE. PERINEURAL INVASION SEEN. 3.  RIGHT APEX: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 4+4=8/10, INVOLVING ONE OF ONE CORE AND 95% OF TOTAL TISSUE.  4.  LEFT PZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, INVOLVING TWO OF MULTIPLE CORES AND 5% OF TOTAL TISSUE. PERINEURAL INVASION SEEN. 5.  LEFT PZ/TZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 4+3=7/10, INVOLVING TWO OF TWO CORES AND 50% OF TOTAL TISSUE.   6.  LEFT APEX: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, INVOLVING ONE OF ONE CORE AND 20% OF TOTAL TISSUE.  ", "path_prostate_specimen": "", "mri_report": "prostate has a maximal lateral diameter of  5.2 cm, a maximal craniocaudal diameter of 5.2  cm and a maximal AP diameter of 3.0 cm resulting in an estimated gland volume of 42 cc.  Status post TURP.    Due to expected TURP changes the zonal anatomy not preserved.    There is a bilateral tumor seen in the left and right posterior peripheral zone from with measuring in its max. extension approx. 4.0 x 2.0 cm (the dominant mass in the upper third/base from 4-8 o'clock) (Image 20 series 501). There is tumor extension involving midthird and apical third (all three levels are involved bilaterally).  No evidence for involvement of the neurovascular bundle on either side.    There is seminal vesicles infiltration (bilateral the seminal vesicle base is infiltrated (Images 22-24 series 501. Image 15 series 401).   No manifest involvement of bladder neck (slightly obscured due to TURP changes. No involvement of  rectal wall.  No suspiciously enlarged obturator and iliac lymph nodes. IMPRESSION:  1) Bilateral prostate cancer with seminal vesicles infiltration. 2) The dominant mass measures 4.0 x 2.0 cm, located in left and right posterior peripheral zones of the prostate base. The tumor extents from base, through midthird into the apex and infiltrates the seminal vesicles infiltration.  3) No manifest involvement of bladder neck (slightly obscured due to TURP changes).  4) No involvement of rectal wall.  5) No suspiciously enlarged obturator or iliac lymph nodes.  6) St. post TURP, with expected defect.  ", "treatment_": "No surgery, his oncology plan was to start definitive external beam radiation theraphy and ADT"}, {"dicom_patient_id": "ProstateDx-01-0003", "source_batch": 0, "tcia_id": "ProstateDx-01-0003", "path_report_biopsy": "specimen is submitted entirely in six cassettes.1-right pz, 2-right pz/tz, 3-right apex, 4-left pz, 5-left pz/tz, 6-left apex.-rg  1.  RIGHT PZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, INVOLVING THREE OF MULTIPLE CORES, AND 15% OF TOTAL TISSUE.  2.  RIGHT PZ/TZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, INVOLVING ONE OF TWO CORES, AND 5% OF TOTAL TISSUE.  3.  RIGHT APEX: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, INVOLVING ONE OF ONE CORE, AND 25% OF TOTAL TISSUE.  4.  LEFT PZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, INVOLVING THREE OF THREE CORES, AND 60% OF TOTAL TISSUE. PERINEURAL INVASION IS SEEN.  5.  LEFT PZ/TZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 4+3=7/10, INVOLVING TWO OF TWO CORES, AND 70% OF TOTAL TISSUE.  6.  LEFT APEX: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, INVOLVING ONE OF ONE CORE, AND 60% OF TOTAL TISSUE.", "path_prostate_specimen": "   ", "mri_report": "prostate has a maximal lateral diameter of  4.1 cm, a maximal craniocaudal diameter of 3.7 cm and a maximal AP diameter of 2.6 cm resulting in an estimated gland volume of 21 cc. The zonal anatomy is preserved.    There signs of chronic prostatitis bilaterally. In the right lobe, midthird peripheral zone at 8 o'clock there is a small area of irregular geographic T2 hypointensity with highly suspicious enhancement (rapid wash-in, rapid wash out) on dynamic contrast enhanced sequences compatible with tumor (series 501 image 10).  In the left midthird to the apex peripheral zone, at 5 o'clock, there is a geographic region of T2 hypointensity with suspicious contrast enhancement (series 704 image 59).  Tumor extends to the capsule bilaterally and there may be capsular infiltration between 7 o'clock and 5 o'clock.   There is no manifest extracapsular tumor mass.     No evidence for involvement of the neurovascular bundle on either side.   Seminal vesicles are partially collapsed, which limits detection for tumor infiltration. There are slightly  thickened walls. No discrete intraluminal tumor masses.    No evidence of involvement of bladder neck and rectal wall.   No suspiciously enlarged obturator and iliac lymph nodes.   IMPRESSION:  1. Bilateral prostate cancer.  Right midthird peripheral zone 7 o'clock infiltrative tumor abutting the capsule.  Left midthird to the apex peripheral zone, at 5 o'clock infiltrative tumor abutting the capsule.  There is possible capsular infiltration between 7 o'clock and 5 o'clock.  2. No manifest extracapsular tumor mass or neurovascular bundle involvement.  3. Minimally filled seminal vesicles limiting evaluation for tumor infiltration, although there are no intraluminal tumor masses", "treatment_": "No surgery, treatment with external beam radiation +/- androgen ablation treatment"}, {"dicom_patient_id": "ProstateDx-01-0004", "source_batch": 0, "tcia_id": "ProstateDx-01-0004", "path_report_biopsy": "specimen is submitted entirely in six cassettes as follows: 1-right PZ, 2-right PZ/TZ, 3-right apex, 4-left PZ, 5-left PZ/TZ, 6-left apex. Final Diagnosis 1.  RIGHT PZ: BENIGN PROSTATIC TISSUE, NO TUMOR IDENTIFIED.  NOTE: IMMUNOHISTOCHEMISTRY STUDIES PERFORMED ON PARAFFIN EMBEDDED TISSUE BLOCK FOR PIN4 (RACEMASE/K309 AND P63) DID NOT REVEAL A STAINING PATTERN DIAGNOSTIC OF INVASIVE CARCINOMA.  2.  RIGHT PZ/TZ: BENIGN PROSTATIC TISSUE WITH CHRONIC INFLAMMATION, NO TUMOR IDENTIFIED.  3.  RIGHT APEX: BENIGN PROSTATIC TISSUE, NO TUMOR IDENTIFIED.  4.  LEFT PZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 4+3=7/10, INVOLVING TWO CORES, ABOUT 60% OF THE TISSUE REPRESENTED. PERINEURAL INVASION IS PRESENT.   5.  LEFT PZ/TZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 4+3=7/10, INVOLVING TWO CORES, ABOUT 70% OF THE TISSUE REPRESENTED. PERINEURAL INVASION IS PRESENT.   6.  LEFT APEX: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 4+3=7/10, INVOLVING TWO CORES, ABOUT 70% OF THE TISSUE REPRESENTED. PERINEURAL INVASION IS PRESENT. ", "path_prostate_specimen": "", "mri_report": "Prostate measures 5.8 x 3.7 x 4.5 cm (estimated volume: 50 cc).    There is a large mass seen predominantly on the left side involving the peripheral zone of the base, midthird and apex as well the central gland of the left (approx 50% of the gland are involved). The mass crosses the midline several times especially in midthird and apex and involves right peripheral zone and right central gland.  The mass abuts the urethra in the apex, with signs of infiltration of  the urethra.  (series 501 slice location 15 image 6). Imaging findings are suggestive for extraprostatic disease at 1) the apex (median) , 2) at the left internal sphincter, with beginning involvement of the muscle, 3) anteriorly beyond the fibromuscular band at the apex and midthird and 4) at the level of midthird and apex the tumor (median and paramedian left)  abuts the Denonvilliers fascia (series 501/slice location 21/ image 8).    No evidence for involvement of the  neurovascular bundle on either side. No evidence for seminal vesicles infiltration.  No evidence of involvement of bladder neck. No suspiciously enlarged obturator and iliac lymph nodes.   ", "treatment_": "No surgery.  Patient has received definitive RT, casodex and lupron"}, {"dicom_patient_id": "ProstateDx-01-0005", "source_batch": 0, "tcia_id": "ProstateDx-01-0005", "path_report_biopsy": "specimen consists of multiple brown/tan core biopsies measuring in length from 0.3 cm to 1.8 cm and 0.01 cm in diameter each.  The specimen is submitted in toto in seven cassettes as follows: 1  right PZ, 2  right PZ/TZ, 3  right apex, 4  left PZ, 5  left PZ/TZ, 6  left apex, 7 - floater.  PROSTATIC CORE NEEDLE BIOPSIES:    1.  RIGHT PZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE (4+3) =7/10, PRESENT IN APPROXIMATELY 10% OF THE TISSUE SUBMITTED.  2.  RIGHT PZ/TZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE (4+4) =8/10, PRESENT IN APPROXIMATELY 10% OF THE TISSUE SUBMITTED.  3.  RIGHT APEX: PROSTATIC ADENOCARCINOMA, GLEASON SCORE (4+4) =8/10, PRESENT IN APPROXIMATELY 20% OF THE TISSUE SUBMITTED.  4.  LEFT PZ: PROSTATIC TISSUE. NO TUMOR IDENTIFIED.  5.  LEFT PZ/TZ: PROSTATIC TISSUE. NO TUMOR IDENTIFIED.  6.  LEFT APEX: PROSTATIC ADENOCARCINOMA, GLEASON SCORE (3+4) =7/10, PRESENT IN APPROXIMATELY 10% OF THE TISSUE SUBMITTED. ", "path_prostate_specimen": "", "mri_report": "prostate has a maximal lateral diameter of  4.9 cm, a maximal craniocaudal diameter of 3.6 cm and a maximal AP diameter of 3.1 cm resulting in an estimated gland volume of 28 cc. The zonal anatomy is preserved.  There is a background of chronic prostatitis.   On the T2-weighted images, there is T2 hypointensity from apex to base involving the nearly the entire right  peripheral zone. On dynamic contrast-enhanced sequences, there is highly suspicious early wash-in and rapid washout compatible with tumor, which extends to the capsule. At the mid-third level, posterior lateral right at 7 o'clock, there is minimal extracapsular disease with radial extension of up to 1 mm.  (series 601, image 11), with possible beginning neurovascular involvement. On the left, the anterior aspect of the peripheral zone from the mid one-third to apical third, there is an area of T2 hypointensity. This region demonstrates highly suspicious contrast enhancement with peak wash in and a rapid wash out suspicious for tumor.  This extends to the capsule and there is  extracapsular invasion posterior lateral at 5 o'clock, without definite tumor extension beyond the \"capsule\" (series 601 image 10), at 4 o'clock. In the apex at 3 o'clock possible capsular infiltration without extraprostatic tumor masses. ( as annotated on PACS).     No evidence for seminal vesicles infiltration.  Seminal vesicles are thin-walled, with intraluminal fluid. No intraluminal masses. No evidence of involvement of bladder neck and rectal wall.  No suspiciously enlarged obturator and iliac lymph nodes. IMPRESSION:  1) Bilateral prostate cancer, with highly suspicion of extracapsular extension on the right, and possible beginning extraprostatic extension on the left.  (Right peripheral zone infiltration from apex to base with extracapsular extension (radial extension 1 mm) and suspicion for neurovascular bundle involvement.  Left anterior peripheral zone tumor from midthird to apical third with possible beginning extracapsular extension at midthird 5 o clock and apex 3 o'clock.)    2) No seminal vesicles  involvement.  3) No pelvic lymphadenopathy.     ", "treatment_": "No surgery, treated with ADT and definitive RT"}, {"dicom_patient_id": "ProstateDx-01-0006", "source_batch": 0, "tcia_id": "ProstateDx-01-0006", "path_report_biopsy": "Biopsy: Specimen consists of multiple brown/tan core biopsies measuring in length from 0.5 cm to 2.3 cm and 0.1 cm in diameter each.  The specimen is submitted in toto in seven cassettes as follows: 1  right PZ, 2  right PZ/TZ, 3  right apex, 4  left PZ, 5  left PZ/TZ, 6  left apex PROSTATE BIOPSIES:  1.  RIGHT PZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, INVOLVING 1 OF 1 CORE, AND 30% OF TOTAL TISSUE.  2.  RIGHT PZ/TZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, INVOLVING 3 OF 3 CORES, AND 20% OF TOTAL TISSUE.  3.  RIGHT APEX: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, INVOLVING 1 OF 1 CORE, AND <5% OF TOTAL TISSUE.  4.  LEFT PZ: BENIGN PROSTATIC TISSUE.  5.  LEFT PZ/TZ: BENIGN PROSTATIC TISSUE.  6.  LEFT APEX: BENIGN PROSTATIC TISSUE.  7.  FLOATER: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, INVOLVING 1 of 2 CORES, AND 20% OF TOTAL TISSUE. and 7  floater.", "path_prostate_specimen": "A: BLADDER NECK  B: PROSTATE AND SEMINAL VESICLE   C: RIGHT VAS DEFERRENS              GrossDescription The specimens are received fresh and fixed in formalin in three containers labeled with the patient' s name, hospital number and A. \"Bladder Neck\", B. \"Prostate and Seminal Vesicles\" and C. \"Right Vas Deferens\".Specimen A consists of a single fragment of fibroconnective tissue measuring 0.7x0.5x0.2 cm.  The serosa is inked in black. The specimen is serially sectioned and submitted entirely in a single cassette labeled A. Specimen B consists of a prostatectomy specimen weighing 53.9 grams.  The prostate measures 5x4.5x3 cm.  The right seminal vesicle measures 4.1x1x0.6 cm.  The left seminal vesicle measures 5x1x0.3 cm.  The right vas deferens is potentially not identified.  The potential right vas deferens measures 1.5 cm in length and 0.5 cm in diameter.  The left vas deferens measures 4 cm in length and 0.5 cm in diameter.  The specimen is inked as follows: blue left, black right.  The margins are removed.  The specimen is serially sectioned to reveal a symmetrically enlarged prostate and nodular cut surface throughout the prostate. The specimen is submitted in representative sections in thirty-nine cassettes as follows: B1 and B2  proximal bladder neck margin, B3 and B4  distal apical margin, B5  left vas deferens, B6  potential right vas deferens, B7 thru B39  prostate submitted entirely as follows: B7 thru B14  left anterior apex to base, B15 thru B23  left posterior apex to base, B24 thru B31  right anterior apex to base, B32 thru B39  right posterior apex to base. Specimen C consists of a single segment of unoriented vas deferens measuring 1.6 cm in length and 0.5 cm in diameter.  PROSTATE GLAND: Radical Prostatectomy Procedure:Radical prostatectomy  Prostate Size   Weight: 53.9 g Size: 5 x 4.5 x 3 cm Lymph Node Sampling: No lymph nodes present  Histologic Type: Adenocarcinoma (acinar, not otherwise specified) Histologic Grade: Gleason Pattern Primary Pattern: Grade 3  Secondary Pattern: Grade 4  Total Gleason Score: 7 / 10 Tumor Quantitation: Proportion (percentage) of prostate involved by tumor: 10 %(The tumor is present predominantly in right prostatic lobe with a single focus of tumor in left lobe (PIN-4 immunostain confirms tumor focus). Extraprostatic Extension: Not identified  Seminal Vesicle Invasion: Not identified  Margins: Margin(s) involved by invasive carcinoma: Apical (focal)  Treatment Effect on Carcinoma:  Not identified  Lymph-Vascular Invasion: Not identified  Perineural Invasion: Present Pathologic Staging (pTNM)  Primary Tumor (pT) pT2c: Bilateral disease.  Regional Lymph Nodes (pN) pNX: Cannot be assessed Distant Metastasis  (pM): Not applicable *Additional Pathologic Findings Inflammation (specify type): Acute and chronic inflammation.. \n", "mri_report": "prostate has a maximal lateral diameter of 5.6 cm, a maximal craniocaudal diameter of 4.5 cm and a maximal AP diameter of 4.1  cm resulting in an estimated gland volume of 54 cc. The zonal anatomy is preserved.     There is a 11 x 9  x 9  mm T2-hypo intense dominant mass seen in the right posterior lateral peripheral zone of prostate base and midthird. The mass shows suspicious enhancement, which is confined to the prostatic borders. The adjacent right neurovascular bundle is not involved.    No evidence for involvement of the neurovascular bundle on either side. No evidence for seminal vesicles infiltration.  No evidence of involvement of bladder neck and rectal wall.  No suspiciously enlarged obturator and iliac lymph nodes.   There is a prominent venous plexus. There is BPH. IMPRESSION:  Right sided prostate cancer in the mid third and base of the prostate, with dominant nodule (11 x 9 x 9 mm)  in the right posterior lateral peripheral zone. No evidence of extracapsular extension.  There is a prominent venous plexus.  ", "treatment_": "Surgery"}, {"dicom_patient_id": "ProstateDx-01-0007", "source_batch": 0, "tcia_id": "ProstateDx-01-0007", "path_report_biopsy": "Specimen consists of multiple brown/tan core biopsies measuring in length from 0.3 cm to 2 cm and 0.01 cm in diameter each.  The specimen is submitted in toto in six cassettes as follows: 1  right PZ, 2  right PZ/TZ, 3  right apex, 4  left PZ, 5  left PZ/TZ, 6  left apex.    Final Diagnosis  PROSTATIC CORE NEEDLE BIOPSIES:    1.  RIGHT PZ: PROSTATIC TISSUE. NO TUMOR IDENTIFIED.  2.  RIGHT PZ/TZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE (3+4) =7/10, PRESENT IN APPROXIMATELY 30% OF THE TISSUE SUBMITTED.  3.  RIGHT APEX: PROSTATIC ADENOCARCINOMA, GLEASON SCORE (3+3) =6/10, PRESENT IN LESS THAN 5% OF THE TISSUE SUBMITTED.  4.  LEFT PZ: PROSTATIC TISSUE WITH MILD CHRONIC INFLAMMATION. NO TUMOR IDENTIFIED.  5.  LEFT PZ/TZ: SINGLE MICROSCOPIC ATYPICAL GLANDULAR FOCUS.  6.  LEFT APEX: SCANT PROSTATIC TISSUE. NO TUMOR IDENTIFIED. ", "path_prostate_specimen": "", "mri_report": "prostate has a maximal lateral diameter of  4.8 cm, a maximal craniocaudal diameter of 3.8 cm and a maximal AP diameter of 3.2  cm resulting in an estimated gland volume of 30 cc. The zonal anatomy is preserved.     There is a 1.5 x 0.9 cm T-2 W hypointense mass seen in the right posterior-lateral peripheral zone in the mid third of the prostate extending into the apex of the prostate, with suspicious enhancement (rapid wash in and out).This nodule abuts the capsule at the level of mid third and apical third, however there is no extraprostatic tumor or enhancement seen at that levels. At the right posterior lateral apex there asymmetric irregular T2-W hypointense tissue with suspicious enhancement seen, with indistinct borders to the surrounding fatty tissue:  beginning extraprostatic extension right posterior lateral at the apex of the prostate possible.   There are several small sub 5 mm areas of indeterminate enhancement seen in the left peripheral zone of the mid and upper third of the prostate, therefore multifocality possible, however the dominant nodule clearly on the right side, and these small areas could also represent chronic prostatitis.    No evidence for involvement of the neurovascular bundle on either side.  No definite seminal vesicles infiltration.  No evidence of involvement of bladder neck and rectal wall.  There are several up to 9 mm rounded lymph nodes seen on the iliac levels on both sides, beginning just above the obturator muscles up to the bifurcation. Some show a fatty hilum. IMPRESSION:   1) Right sided prostate cancer with the dominant nodule (1.5 x 0.9 cm) in the midthird and apical third of the prostate in the posterior lateral peripheral zone. Possible beginning extraprostatic extension at the posterior lateral right apex. Several up to 9 mm iliac lymph nodes bilateral, of unknown significance.    No evidence of seminal vesicle infiltration or involvement of bladder neck or rectum.    2) BPH, Chronic prostatitis. ", "treatment_": "No surgery, radical prostatectomy was less desirable due to his age, patient is contemplating other treatment options"}, {"dicom_patient_id": "ProstateDx-01-0008", "source_batch": 0, "tcia_id": "ProstateDx-01-0008", "path_report_biopsy": "", "path_prostate_specimen": "Radical prostatectomy   Prostate Size:      Weight: 51.4 g      Size: 5X4.5X4.0cm  Lymph Node Sampling  Pelvic lymph node dissection  Histologic Type : Adenocarcinoma (acinar, not otherwise specified)  Histologic Grade  Gleason Pattern Primary Pattern: Grade 3 Secondary Pattern: Grade 4  Total Gleason Score: 3+4=7/10  Tumor Quantitation: Proportion (percentage) of prostate involved by tumor: 20%  Extraprostatic Extension:  Present, focal (left anterior lobe at the base)  Seminal Vesicle Invasion: Not identified   Margins: Margins uninvolved by invasive carcinoma   Treatment Effect on Carcinoma: Not identified   Lymph-Vascular Invasion: Not identified   Perineural Invasion: Present  Pathologic Staging (pTNM):  Primary Tumor (pT) pT3a     Extraprostatic extension or microscopic invasion of bladder neck  Regional Lymph Nodes (pN)  pN0:     No regional lymph node metastasis Specify:     Number examined: 26      Number involved: 0       Distant Metastasis (pM)  Not applicable  Pathologic Staging pT3a pN0 pMx  *Additional Pathologic Findings High-grade prostatic intraepithelial neoplasia (PIN)    B.  PORTION OF LEFT SEMINAL VESICLE: FIBROVASCULAR AND FIBROADPISE TISSUE. NO SEMINAL VESICLE TISSUE IDENTIFIED (ENTIRE SPECIMEN SUBMITTED FOR HISTOLOGICAL EXAMINATION) NO TUMOR IDENTIFIED.     C.  RIGHT EXTERNAL ILIAC LYMPH NODES: EIGHT (8) REACTIVE LYMPH NODES, NO TUMOR IDENTIFIED.   Addendum Diagnosis  IMMUNOSTAIN FOR AE1/AE3 PERFORMED ON BLOCK C1 IS NEGATIVE.  IMMUNOSTAIN FOR AE1/AE3 WILL BE EXAMINED AND RESULTS REPORTED IN AN ADDENDUM.   D.  RIGHT OBTURATOR LYMPH NODES:   SEVEN (7) REACTIVE LYMPH NODES, NO TUMOR IDENTIFIED.   E.  LEFT EXTERNAL ILIAC LYMPH NODES:   FIVE (5) REACTIVE LYMPH NODES, NO TUMOR IDENTIFIED.   F.  LEFT OBTURATOR LYMPH NODES:   SIX (6) REACTIVE LYMPH NODES, NO TUMOR IDENTIFIED.   G.  RIGHT SEMINAL VESICLE:   SEMINAL VESICLE TISSUE. NO TUMOR IDENTIFIED. Addendum Diagnosis  IMMUNOSTAIN FOR AE1/AE3 PERFORMED ON BLOCK C1 IS NEGATIVE. ", "mri_report": "prostate has a maximal lateral diameter of 4.8 cm, a maximal craniocaudal diameter of 4.3 cm and a maximal AP diameter of 2.2 cm resulting in an estimated gland volume of 25 cc. The zonal anatomy is preserved   There is a T2-w hypointense nodule seen in the left base/midthird measuring 11 x 7 x 15 mm, in the posterior lateral peripheral zone at 4-6 o'clock. There is associated suspicious enhancement. This is highly suspicious  for prostate cancer. The adjacent \"capsule\" shows also increased enhancement, which suggests capsular infiltration. No manifest tumor mass seen beyond the capsule.    No evidence for involvement of the neurovascular bundle on either side.   No evidence for seminal vesicles infiltration.  No evidence of involvement of bladder neck and rectal wall.  No suspiciously enlarged obturator and iliac lymph nodes. (bilateral  <5 mm iliac lymph nodes)   Multiplanar reconstructions, subtraction images, and CAD analysis of the dynamic series for assessment of the kinetic information facilitated the interpretation of the exam.      IMPRESSION:  1) 1.5 cm tumor in the left posterior lateral peripheral zone, with dominant nodule in base and midthird, with capsular infiltration, however, there are no manifest tumor masses beyond the capsule seen.  2) No evidence for right sided tumor.  3) No evidence of seminal vesicle infiltration or lymphadenopathy. ", "treatment_": "Surgery"}, {"dicom_patient_id": "ProstateDx-01-0009", "source_batch": 0, "tcia_id": "ProstateDx-01-0009", "path_report_biopsy": "", "path_prostate_specimen": "A: LEFT OBTURATOR LYMPH NODE POCKET B: RIGHT OBTURATOR LYMPH NODE POCKET C: PROSTATE AND SEMINAL VESICLES  Final Diagnosis  A.  LEFT OBTURATOR LYMPH NODE POCKET:   FOUR (4) REACTIVE LYMPH NODES, NO TUMOR IDENTIFIED.   B.  RIGHT OBTURATOR LYMPH NODE POCKET:   FOUR (4) REACTIVE LYMPH NODES, NO TUMOR IDENTIFIED.   C.  PROSTATE AND SEMINAL VESICLES:   Procedure:  Radical prostatectomy Prostate Size: 3.5x3x2.6cm Weight: 30.6g Lymph Node Sampling: Pelvic lymph node dissection Histologic Type: Adenocarcinoma (acinar, not otherwise specified) Histologic Grade: Gleason grade 3+3 score = 6/10      Primary pattern: Grade 3      Secondary pattern: Grade 3 Tumor Quantitation: Proportion (percentage) of prostate involved by tumor: 15% Extraprostatic Extension:  Not identified Seminal Vesicle Invasion: Not identified Margins: Margins uninvolved by invasive carcinoma Treatment Effect on Carcinoma: Not identified Lymph-Vascular Invasion: Not identified Perineural Invasion: Present Additional Pathologic Findings: High-grade prostatic intraepithelial neoplasia (PIN) and chronic inflammation  Pathologic Staging (pTNM)   Primary Tumor (pT)      pT2c:     Bilateral disease  Regional Lymph Nodes (pN)      pN0:     No regional lymph nodes metastasis       Specify:     Number examined: 8      Number involved: 0  Distant Metastasis (pM) Pathologic Stage: (pT2c, pN0)    ", "mri_report": " prostate has a maximal lateral diameter of  4.6 cm, a maximal craniocaudal diameter of 3.7 cm and a maximal AP diameter of 2.2 cm resulting in an estimated gland volume of 20 cc. The zonal anatomy is preserved.     In the midthird  and apical third the prostate there are geographic areas of low signal on the T2-weighted images in the posterior aspects of the peripheral zones of both side between 5:00 and 8:00. The  dominant area measures 18 x 6 mm and is located in the midthird paramedian right between 6 and 8:00 and extents into the apical third. This area shows also suspicious kinetics on the dynamic series.The area abuts the \"pseudo-capsule\" posterior and posterior lateral. However, there is NO  evidence for involvement of the neurovascular bundle on either side.   No evidence for seminal vesicles infiltration.  No evidence of involvement of bladder neck and rectal wall.  No suspiciously enlarged obturator and iliac lymph nodes; several up to 7 x 4 mm obturator lymph nodes seen, on both sides. IMPRESSION:   1) Bilateral tumor, predominantly on the right within the posterior and posterior lateral peripheral zones between 5 and 8 o'clock, in mid third and apical third of the prostate,  as detailed above (significant images are annotated on PACS). 2) No evidence of extraprostatic disease - specifically no evidence of extension into the neuro-vascular bundles of either side.   ", "treatment_": "Surgery"}, {"dicom_patient_id": "ProstateDx-01-0010", "source_batch": 0, "tcia_id": "ProstateDx-01-0010", "path_report_biopsy": "The specimen consists of multiple core fragments of tan soft tissue measuring 0.8cm to 1.5cm in length and 0.1cm in diameter.  The specimen is submitted entirely in six cassettes. 1-right pz, 2-right pz/tz, 3-right apex, 4-left pz, 5-left pz/tz, 6-left apex. PROSTATE:     1-RIGHT PZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 4+4=8/10, INVOLVING 50% OF THE TISSUE REPRESENTED.   2-RIGHT PZ/TZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 4+3=7/10, INVOLVING 80% OF THE TISSUE REPRESENTED.  3-RIGHT APEX: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 4+3=7/10, INVOLVING 50% OF THE TISSUE REPRESENTED.  4-LEFT PZ: PROSTATIC TISSUE. NO TUMOR IDENTIFIED.  5-LEFT PZ/TZ: PROSTATIC TISSUE. NO TUMOR IDENTIFIED.   6-LEFT APEX: PROSTATIC TISSUE. NO TUMOR IDENTIFIED.", "path_prostate_specimen": ".        ", "mri_report": "prostate has a maximal lateral diameter of  4.5 cm, a maximal craniocaudal diameter of 4.2 cm and a maximal AP diameter of 2.8 cm resulting in an estimated gland volume of 28 cc. The zonal anatomy is preserved.     In the mid third of the prostate, in the right posterior lateral peripheral zone between 6:00 and 10:00 there is a geographic 2.0 x 1.8 cm hypointense mass seen which shows rapid wash-in and washout on the dynamic series.(slice location 39; series 501; 401 and 701-709). There is bulging of the tumor at 8-10 o'clock towards the pubo-rectal sling, which seems not to be involved since there is a thin fatty line preserved between tumor and muscle. No manifest extraprostatic tumor mass seen. (\"capsular infiltration\" is likely). The right neuro vascular bundle seems not to be involved. The tumor extends to the apical and upper third of the prostate.    No evidence for involvement of the neurovascular bundle on either side. No evidence for seminal vesicles infiltration.  No evidence of involvement of bladder neck and rectal wall.  No suspiciously enlarged obturator and iliac lymph nodes.   Multiplanar reconstructions, subtraction images, and CAD analysis of the dynamic series for assessment of the kinetic information facilitated the interpretation of the exam;performed by radiologist.    IMPRESSION: 2 cm bulging mass in the right posterior and lateral peripheral zone of the midthird of the prostate, with extension into the upper third and lower (apical third);  with likely \"capsular infiltration\" in proximity to the right pubo-rectal sling (at level of mid third) ,  without manifest extracapsular extension. No evidence of neurovascular bundles involvement. No seminal vesicles infiltration.", "treatment_": "No surgery, treated with casodex, ADT and XRT"}, {"dicom_patient_id": "ProstateDx-01-0011", "source_batch": 0, "tcia_id": "ProstateDx-01-0011", "path_report_biopsy": "Gross Description The specimen consists of multiple core fragments of tan soft tissue measuring 0.5cm to 2.3cm in length and 0.1cm in diameter.  The specimen is submitted in six cassettes.1-right pz, 2-right pz/tz, 3-right apex, 4-left pz, 5-left pz/tz, 6-left apex. 1.  RIGHT PZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, INVOLVING TWO CORES, ABOUT 20% OF TISSUE REPRESENTED. 2.  RIGHT PZ/TZ: BENIGN PROSTATIC TISSUE, NO TUMOR IDENTIFIED. 3.  RIGHT APEX: BENIGN PROSTATIC TISSUE, NO TUMOR IDENTIFIED. 4.  LEFT PZ:  PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, INVOLVING TWO CORES, ABOUT 30% OF TISSUE REPRESENTED. 5.  LEFT PZ/TZ: BENIGN PROSTATIC TISSUE, NO TUMOR IDENTIFIED. 6.  LEFT APEX: BENIGN PROSTATIC TISSUE, NO TUMOR IDENTIFIED.", "path_prostate_specimen": "", "mri_report": "The prostate has a maximal lateral diameter of 4.7cm, a maximal craniocaudal diameter of 3.9cm and a maximal AP diameter of 2.7  cm resulting in an estimated gland volume of 26 cc. The zonal anatomy is preserved.    The entire prostate shows on the T2-weighted images a diffuse fine linear and fine nodular  hypointense signal alterations compatible with chronic prostatitis. Smallest foci (smaller than 4 mm)  of cancer cannot be excluded.  On the dynamic contrast-enhanced series there is a 1.7 x 0.7 cm area of suspicious wash-in and washout seen in the left peripheral zone between 9 and 6:00 in the prostate base and midthird.  No evidence for involvement of the neurovascular bundle on either side.   No evidence for seminal vesicles infiltration.  No evidence of involvement of bladder neck and rectal wall.  No suspiciously enlarged obturator and iliac lymph nodes. IMPRESSION: 1) 1.7 cm area of highly suspicious enhancement in the left posterior lateral (between 9-6 o clock)  peripheral zone of the midthird and base of the prostate.   2) On the background of diffuse chronic prostatitis. Small foci of cancer on the right cannot be excluded (smaller than 4 mm).  3) No evidence of extraprostatic disease on either side. Unremarkable Seminal vesicles 4) No pelvic lymphadenopathy. ", "treatment_": "No surgery, was considered for radiation theraphy"}, {"dicom_patient_id": "ProstateDx-01-0012", "source_batch": 0, "tcia_id": "ProstateDx-01-0012", "path_report_biopsy": "Gross Description: The specimen consists of multiple core fragments of tan soft tissue measuring 1.4cm to 1.9cm in length and 0.1cm in circumference.  The specimen is submitted entirely in six cassettes. PROSTATE:   1-RIGHT PZ: PROSTATE TISSUE WITH FOCAL CHRONIC INFLAMMATION. NO TUMOR IDENTIFIED. 2-RIGHT PZ/TZ: PROSTATIC ADENOCARCINOA, GLEASON SCORE 3+4+7/10, INVOLVING 25% OF  THE TISSUE REPRESENTED. 3-RIGHT APEX: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, INVOLVING 1% OF THE TISSUE REPRESENTED. 4-LEFT PZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, INVOLVING 60% OF THE TISSUE REPRESENTED. 5-LEFT PZ/TZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, INVOLVING 70% OF THE TISSUE REPRESENTED. 6-LEFT APEX: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, INVOLVING 40% OF THE TISSUE REPRESENTED.", "path_prostate_specimen": "", "mri_report": "The prostate has a maximal lateral diameter of  4.7 cm, a maximal craniocaudal diameter of 4.6 cm and a maximal AP diameter of 2.6  cm resulting in an estimated gland volume of 29 cc. The zonal anatomy is preserved. There is T2-hypointense signal seen in the posterior and posterior lateral peripheral zone, mid third and apical third, bilateral.(more on the left). Largest dominant nodule on the left is 11 x 13 mm at 5 o'clock apical peripheral zone; the largest dominant nodule on the right is seen in at 8 o'clock mid third of the prostate (also peripheral zone) measuring  7 x 6 mm. These areas show suspicious enhancement curves on the dynamic series.  No evidence for involvement of the neurovascular bundle on either side.No evidence for seminal vesicles infiltration.  No evidence of involvement of bladder neck and rectal wall. No suspiciously enlarged obturator and iliac lymph nodes.IMPRESSION: Bilateral (left more than right) prostate cancer in the midthird and apical third of the prostate within the peripheral zones.  No MRI evidence of extraprostatic extension.   ", "treatment_": "No surgery, radiation theraphy"}, {"dicom_patient_id": "ProstateDx-01-0013", "source_batch": 0, "tcia_id": "ProstateDx-01-0013", "path_report_biopsy": "The specimen is received fixed in a single container labeled with the patient's name, hospital number and Prostate.  The specimen consists of multiple core fragments of tan soft tissue measuring from 1.5cm to 2cm in length and 0.1cm in diameter.  The specimen is submitted in six cassettes as follows: 1-right PZ, 2-right PZ TZ, 3-right apex, 4-left PZ, 5-left PZ TZ, 6-left apex.- Specimen(s) Received PROSTATE BIOPSIES: 1.  RIGHT PZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, INVOLVING 40% OF THE TISSUE EXAMINED (TWO CORES). 2.  RIGHT PZ/TZ: BENIGN PROSTATIC TISSUE, NO TUMOR IDENTIFIED. 3.  RIGHT APEX: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, INVOLVING 30% OF THE TISSUE EXAMINED (TWO CORES). 4.  LEFT PZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, INVOLVING 40% OF THE TISSUE EXAMINED (TWO CORES). 5.  LEFT PZ/TZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, INVOLVING 5% OF THE TISSUE EXAMINED (ONE CORE). 6.  LEFT APEX: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, INVOLVING 40% OF THE TISSUE EXAMINED (TWO CORES). NOTE:  PERINEURAL INVASION PRESENT. ", "path_prostate_specimen": "Specimen(s) Received  A. \"Left Pelvic Lymph Node\", B. \"Right Pelvic Lymph Node\", C. \"Bladder Neck Tissue\" and D. \"Prostate and Seminal Vesicles\". Specimen A consists of a 4.5x1x05. cm piece of fibrofatty tissue from which a 4 cm whole lymph node dissected.  The lymph node is serially sectioned and the entire specimen is submitted in two cassettes labeled A1 and A2.  Specimen B consists of a 3.5x2x0.5 cm piece of fibroadipose tissue which contains a 3 cm single lymph ode. The lymph node is serially sectioned and submitted entirely in two cassettes labeled B1 and B2.  Specimen C consists of a 1x0.5x0.3 cm piece of tan/white tissue. The specimen is submitted entirely in a single cassette labeled C.   Specimen D consists of a 49.1 gram, 4x3x2.5 cm radical prostatectomy specimen.  The attached right and left vas average 4 cm in length by 3 cm in diameter, the right and left seminal vesicles average 3.5x1.5x0.5 cm.  The specimen is inked as follows: right side black and left side blue.  The proximal and distal margins are taken enface and radial sectioned.  The remaining specimen is transversely sectioned to reveal a vaguely nodular cut surface.  Representative sections are submitted in cassettes as follows: D1 and D2  radial section, proximal bladder base margin, D3 and D4  radial section, distal urethral margin, D5  right vas and right seminal vesicle, D6  left vas and left seminal vesicle, D7 thru D10  right anterior lobe, inferior to superior, D11 thru D14  right posterior lobe, inferior to superior, D15 thru D18  left posterior lobe, inferior to superior, D19 thru D22  left anterior lobe, superior to inferior.  Final Diagnosis  A.  LEFT PELVIC LYMPH NODE:  TWO (2) REACTIVE LYMPH NODES, NO TUMOR IDENTIFIED.  B.  RIGHT PELVIC LYMPH NODE:  FOUR (4) REACTIVE LYMPH NODES, NO TUMOR IDENTIFIED.   C.  BLADDER NECK TISSUE:  FRAGMENT OF FIBROCOLLAGENOUS TISSUE, NO TUMOR IDENTIFIED.  D.  PROSTATE AND SEMINAL VESICLES:   Prostate Size:  Weight:      49.1g  Size: 4x3x2.5cm Lymph Node Sampling: Pelvic lymph node dissection  Histologic Type: Adenocarcinoma  Histologic Grade:  Primary Pattern Grade 3 Secondary Pattern Grade 4  Total Gleason Score: 3+4=7/10  Tumor Quantitation:  Proportion (percentage) of prostate involved by tumor: 50% Extraprostatic Extension:   Not identified.  Seminal Vesicle Invasion:  Not identified  Margins: Margins uninvolved by invasive carcinoma  Lymph-Vascular Invasion: Not identified  Perineural Invasion:  Present\nPathologic Staging (pTNM)   Primary Tumor (pT)  pT2c: Bilateral disease  Regional Lymph Nodes (pN)  pNo:     No regional lymph node metastasis   Specify:     Number examined: 7 Number involved: 0\nDistant Metastasis (pM)   pMx:     Not applicable   AJCC Pathologic Stage (7th edition): (pT2c, pNo) \nClinical diagnosis and History: Prostate cancer\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "mri_report": "FINDINGS:    The prostate gland measures 5.0 (TV) x 3.3 (AP) x 3.5 (CC) cm and the prostate volume measures 30.0 cc.  The zonal anatomy of the prostate gland is preserved.   There is diffuse low T2 signal in left and right posterolateral peripheral zones (PZ) with a dominate nodule in the right posterolateral peripheral zone measuring 2.0 x 0.8 cm in the mid third of the gland and dominant nodule in the left posterolateral PZ measuring 1.2 x 1.0 cm. The posterolateral nodules extend to the prostatic capsule without definitive extracapsular extension. An additional nodule is visualized and the anterior aspect of the left peripheral zone at the 2:00 position which bulges the capsule with no definite extracapsular involvement.  Within these areas, suspicious contrast enhancement is visualized with a rapid wash-in and washout pattern. No neurovascular involvement is visualized. The seminal vesicles are not involved.  The urinary bladder and rectum are uninvolved. A prominent venous plexus is visualized.  There is benign prostatic hypertrophy. The diagnostic value of the lymph node sequences is reduced secondary to extensive air and stool throughout the large bowel.  A right obturator lymph node is visualized measuring 0.8 x 0.5 cm (slice location 50, series 701). No suspicious bone marrow signal abnormalities are seen. Multiplanar reconstructions, subtraction images, and CAD analysis of the dynamic series for assessment of the kinetic information facilitated the interpretation of the exam.   \nIMPRESSION: \n1. Bilateral prostate cancer, left greater than right, with no manifest extracapsular extension; capsular infiltration, especially left posterior lateral towards the left neurovascular bundle,  is possible.  No MRI evidence of neurovascular bundle or seminal vesicle involvement.  2. Limited evaluation for  pelvic lymphadenopathy secondary to the bowel and stool-filled colon. Indeterminate 8 mm right obturator lymph node (superior lateral to the right seminal vesicles); recommend CT of the pelvis for further evaluation.  3. Benign prostatic hypertrophy.\n", "treatment_": "Surgery"}, {"dicom_patient_id": "ProstateDx-01-0014", "source_batch": 0, "tcia_id": "ProstateDx-01-0014", "path_report_biopsy": "A. PROSTATE, LEFT APEX: BENIGN PROSTATIC TISSUE. NO TUMOR IDENTIFIED. B. PROSTATE, LEFT APEX LATERAL: BENIGN PROSTATIC TISSUE. NO TUMOR IDENTIFIED. C. PROSTATE, RIGHT APEX: PROSTATIC ADENOCARCINOMA, GLEASON GRADE 3+3 = 6/10, INVOLVING 50% OF THE TISSUE, 1 OF 1 CORE. D. PROSTATE, RIGHT APEX LATERAL: PROSTATIC ADENOCARCINOMA, GLEASON GRADE 3+3 = 6/10, INVOLVING 50% OF THE TISSUE, 1 OF 1 CORE. E. PROSTATE, LEFT MID: BENIGN PROSTATIC TISSUE. NO TUMOR IDENTIFIED. F. PROSTATE, LEFT MID LATERAL: BENIGN PROSTATIC TISSUE. NO TUMOR IDENTIFIED. G. PROSTATE, RIGHT MID: BENIGN PROSTATIC TISSUE. NO TUMOR IDENTIFIED. H. PROSTATE, RIGHT MID LATERAL: PROSTATIC TISSUE WITH FOCAL HIGH GRADE PROSTATIC INTRAEPITHELIAL NEOPLASIA (PIN). I. PROSTATE, LEFT BASE: BENIGN PROSTATIC TISSUE. NO TUMOR IDENTIFIED. J. PROSTATE, LEFT BASE LATERAL: PROSTATIC ADENOCARCINOMA, GLEASON GRADE 4+3 = 7/10, INVOLVING 15% OF THE TISSUE, 1 OF 1 CORE. K. PROSTATE, RIGHT BASE: BENIGN PROSTATIC TISSUE. NO TUMOR IDENTIFIED. L. PROSTATE, RIGHT BASE LATERAL: BENIGN PROSTATIC TISSUE. NO TUMOR IDENTIFIED  ", "path_prostate_specimen": "Gross Description  The specimens are received fresh in five containers labeled with the patient' s name, hospital number and A. \"Right Vas\", B. \"Left Lymph Node Packet\", C. \"Right Lymph Node Packet\", D. \"Prostate\" and E. \"Bladder Neck\". Specimen A consists of a single fragment of firm tissue measuring 1x0.5 cm.  The specimen is submitted entirely in a single cassette labeled A.  Specimen B consists of multiple fragments of yellow fatty tissue measuring 4x3x1 cm in aggregate.  There is one lymph node identified measuring 0.7 cm. The specimen is submitted entirely in two cassettes labeled B1 and B2 with the lymph node submitted in cassette B1.  Specimen C consists of multiple fragments of yellow fatty tissue collectively measuring 3x2.2x0.8 cm. The specimen is submitted entirely in two cassettes labeled C1 and C2.  Specimen D consists of a total prostatectomy specimen including prostate with attached left and right seminal vesicles and segments of vas deferens.  The specimen weighs 106.6 grams and measures 5.5x5x4.8 cm in greatest dimensions.  The right and left seminal vesicles appear very thin and measure 3.4x1.8x0.3 cm and 3.5x1x0.3 cm, respectively.  The right and left vas deferens appear disrupted and incomplete with the left measuring 2.3 cm in length and 0.3 cm in diameter and the right measures 1.8 cm in length and 0.5 cm in diameter.  The prostate appears asymmetrical with the left lobe appearing slightly larger than the right lobe.  Cross-sectioning reveals a poorly circumscribed yellow/white nodule involving the right and left anterior lobe measuring 1.9x1 cm.  The tumor is grossly 1 cm away from the base and 1 cm away from the apex.  The remaining prostatic parenchyma is grayish/white and nodular.  Representative sections are submitted in cassettes as follows: D1  right and left vas deferens margin, D2  right urethral margin, D3 and D4  left urethral margin, D5  right bladder neck margin, D6  left bladder neck margin, D7 thru D11  right anterior lobe sectioned from apex to base submitted every other section, D12 thru D18  right posterior sectioned from apex to base submitted every other section with cassette D18 containing the seminal vesicle, D19  thru D24  left anterior lobe sectioned from apex to base submitted every other section and D25 thru D30  left posterior lobe sectioned from apex to base submitted every other section with cassette D30 containing the seminal vesicle, D31 thru D46 remaining left lobe of prostate.  Specimen E consists of multiple fragments of tiny brown fatty tissue measuring from 0.3 cm to 0.5 cm  The specimen is submitted entirely in a single cassette labeled E.  Final Diagnosis A.RIGHT VAS: SEGMENT OF VAS DEFERENS, NO TUMOR IDENTIFIED.  B.LEFT LYMPH NODE PACKET: TWO (2) REACTIVE LYMPH NODES, NO TUMOR IDENTIFIED. C.RIGHT LYMPH NODE PACKET:  FOUR (4) REACTIVE LYMPH NODES, NO TUMOR IDENTIFIED.  D.PROSTATE:  Procedure: Radical Prostatectomy Prostate Size: 5.5x5x4.8cm Weight: 106.6 grams  Lymph Node Sampling: Pelvic lymph node dissection  Histologic Type: Adenocarcinoma (acinar, not otherwise specified) Gleason Score  Primary Pattern: 3  Secondary Pattern: 3  Total Gleason Score: 3+3=6/10  Tumor Quantitation / Proportion of prostate involved by tumor: Approximately 2%  Extraprostatic Extension: Not identified   Seminal Vesicle Invasion: Not identified  Margins:  Margins uninvolved by invasive carcinoma  Treatment Effect on Carcinoma: Not identified  Lymph-Vascular Invasion: Not identified  Perineural Invasion: Present   Additional Pathologic Findings: Acute and Chronic Inflammation, High grade PIN and BPH  AJCC Pathologic Staging: (pT2c, pN0, pMx)  pT2c: Bilateral disease pN0: No regional lymph node metastasis  Specify: Number examined: 6 Number involved: 0 pMx:     Not applicable E. BLADDER NECK:FRAGMENTS OF ADIPOSE TISSUE AND BLOOD CLOT ONLY. NO TUMOR IDENTIFIED.\n", "mri_report": "FINDINGS:  The prostate has a maximal lateral diameter of   6.3 cm, a maximal craniocaudal diameter of 5.7 cm and a maximal AP diameter of 4.9 cm resulting in an estimated gland volume of 91 cc. The zonal anatomy is preserved. There is a prominent middle lobe due to marked BPH.   There  is a large suspiciously enhancing tumor seen in the right posterior lateral peripheral zone involving all 3 levels of the prostate from base to apex. Measuring approximately 3.6 x 1.6 x 2.4 cm. At the base the tumor crosses the midline into the left peripheral zone. At the apex and lower midthird, posterior lateral at the 7-8 o'clock position there is capsular infiltration present without manifest tumor mass extending beyond the capsule. (slice location a 33 series 501).  There is a large prominent middle lobe present.  No evidence for involvement of the neurovascular bundle on either side. No evidence for seminal vesicles infiltration.  No evidence of involvement of bladder neck and rectal wall.  No suspiciously enlarged obturator and iliac lymph nodes. Multiplanar reconstructions, subtraction images, and CAD analysis of the dynamic series for assessment of the kinetic information facilitated the interpretation of the exam.      IMPRESSION:  1) 3.6 cm tumor in the right peripheral zone with capsular infiltration posterior lateral  at 7-8 o'clock in the lower mid third and apex, as described above. 2) No evidence of manifest extracapsular decease.  3) No evidence of involvement of  the neurovascular bundles on either side, however  if nerve sparing is planned, this should be considered  only on the  left side due to the proximity of the tumor to the right neurovascular bundle and the capsular infiltration on that side. No involvement of the seminal vesicles. No lymphadenopathy.  4) Marked BPH with prominent middle lobe; Prostate volume estimated 91 cc", "treatment_": "Surgery"}, {"dicom_patient_id": "ProstateDx-01-0015", "source_batch": 0, "tcia_id": "ProstateDx-01-0015", "path_report_biopsy": "1-RIGHT PZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10 INVOLVING 40% OF THE TISSUE REPRESENTED. 2-RIGHT PZ/TZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10 INVOLVING 50% OF THE TISSUE REPRESENTED. 3-RIGHT APEX: PROSTATIC TISSUE, NO TUMOR IDENTIFIED. 4-LEFT PZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10 INVOLVING 60% OF THE TISSUE REPRESENTED. 5-LEFT PZ/TZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10 INVOLVING 30% OF THE TISSUE REPRESENTED. 6-LEFT APEX: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10 INVOLVING 15% OF THE TISSUE REPRESENTED.", "path_prostate_specimen": "", "mri_report": "FINDINGS:  The prostate has a maximal lateral diameter of  5.6cm, a maximal cranio-caudal diameter of 4.2cm and a maximal AP diameter of 4.5 cm resulting in an estimated gland volume of 55 cc. The zonal anatomy is preserved.  The central gland shows moderate BPH.  In the right peripheral zone, posterior lateral, from 7-9 o'clock,  in the mid third of the prostate with extension into the base there is a 2.4 x 0.9 cm tumor seen. The pseudocapsule at the right neurovascular bundle cannot be delineated continuously and appears irregular;  Within the neurovascular bundle itself no manifest tumor mass seen.  In the left peripheral zone ,within the apical third, (with extension to the midthird) and in predominantly in the left apex, there is a second mass seen between 3-6 o'clock, measuring 1.9 x 1.6 cm. At 9:00 at the apex this tumor mass cannot be delineated from the pubo-rectal sling/superior edge of the internal sphincter and abuts the urethra. At this point no extraprostatic disease visualized. However, tumor extents to apical margin and lateral margin of the gland. Extraprostatic extension is to be expected soon.   No evidence for involvement of the neurovascular bundle on the left side. No evidence for seminal vesicles infiltration.   No evidence of involvement of bladder neck and rectal wall. No suspiciously enlarged obturator and iliac lymph nodes. There is a 4 x 7 mm perirectal lymph node seen at 10 o'clock, one centimeter posterior to the right seminal vesicles. IMPRESSION:   1) Bilateral Prostate Cancer with a dominant mass in the right posterior lateral mid-third of the prostate, and a second dominant mass in the left apex.  2) Beginning capsular infiltration at the right neurovascular bundle likely, without manifest extracapsular disease. If nerve sparing is performed, right side should be excluded, left sided nerve sparing is possible.   3) No definite extraprostatic extension at the left apex, however, tumor mass reaches the margins of the gland apical and lateral.   4) Oval 4 x 7 mm right perirectal lymph node at 10 o'clock; just one cm posterior to the right seminal vesicles. This is an unspecific finding. Otherwise, no enlarged or suspicious obturator or iliac lymph nodes on either side. 5) No Seminal vesicles infiltration, no involvement of Urinary bladder or rectum.  \n", "treatment_": "No surgery, patient received radiation theraphy"}, {"dicom_patient_id": "ProstateDx-01-0016", "source_batch": 0, "tcia_id": "ProstateDx-01-0016", "path_report_biopsy": "PROSTATE BIOPSIES A. LEFT BASE: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, INVOLVING ABOUT 60% OF THE TISSUE SUBMITTED. PERINEURAL INVASION IS PRESENT. HIGH-GRADE PROSTATIC INTRAEPITHELIAL NEOPLASIA (PIN) IS PRESENT. B. LEFT LATERAL BASE: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, INVOLVING ABOUT 90% OF THE TISSUE SUBMITTED. PERINEURAL INVASION IS PRESENT. C. LEFT MID: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, INVOLVING ABOUT 75% OF THE TISSUE SUBMITTED. PERINEURAL INVASION IS PRESENT. D. LEFT LATERAL MID: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, INVOLVING ABOUT 80% OF THE TISSUE SUBMITTED. E. LEFT APEX: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, INVOLVING ABOUT 70% OF THE TISSUE SUBMITTED. F. LEFT LATERAL APEX: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, INVOLVING ABOUT 60% OF THE TISSUE SUBMITTED. G. RIGHT BASE: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, INVOLVING ABOUT 75% OF THE TISSUE SUBMITTED. H. RIGHT LATERAL BASE: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, INVOLVING ABOUT 80% OF THE TISSUE SUBMITTED. I. RIGHT MID: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, INVOLVING ABOUT 60% OF THE TISSUE SUBMITTED. HIGH-GRADE PROSTATIC INTRAEPITHELIAL NEOPLASIA (PIN) IS PRESENT. J. RIGHT LATERAL MID: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, INVOLVING ABOUT 80% OF THE TISSUE SUBMITTED. HIGH-GRADE PROSTATIC INTRAEPITHELIAL NEOPLASIA (PIN) IS PRESENT. K. RIGHT APEX: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, INVOLVING ABOUT 70% OF THE TISSUE SUBMITTED. HIGH-GRADE PROSTATIC INTRAEPITHELIAL NEOPLASIA (PIN) IS PRESENT. L. RIGHT LATERAL APEX: BLOOD CLOT ONLY, INSUFFICIENT TISSUE FOR DIAGNOSIS", "path_prostate_specimen": "", "mri_report": "FINDINGS:  The prostate has a maximal lateral diameter of  4.5 cm, a maximal craniocaudal diameter of 3.1 cm and a maximal AP diameter of 2.6 cm resulting in an estimated gland volume of 20 cc. The zonal anatomy is not clearly preserved.\n  The entire prostate including central gland and bilateral peripheral zones show on the T2 weighted images diffuse hypo-intense signal alterations. There is also diffuse suspicious enhancement seen, involving diffusely the entire gland. At the left recto-prostatic angle, just below the seminal vesicals, the prostate border appears irregular and spiculated. (Slight location 33 series 401). This irregular border is seen only in the upper third (base) and is adjacent to the left neurovascular bundle.   No evidence for seminal vesicles infiltration.  No evidence of involvement of bladder neck and rectal wall.  No suspiciously enlarged obturator or iliac lymph nodes. The osseous structures of the pelvic ring show diffuse geographic T2 and T1 weighted signal alteration with foci of atypical enhancement.  Multiplanar reconstructions, subtraction images, and CAD analysis of the dynamic series for assessment of the kinetic information facilitated the interpretation of the exam.  \n   IMPRESSION:  1) MRI findings suggestive for bilateral prostate cancer with diffuse involvement of the entire gland. The (Findings could be altered by prior therapy (status post radiation therapy?) and or diffuse high grade PIN mixed with cancerous tissue.) Beginning extracapsular extension at the left base posterior lateral likely. 2) Diffuse geographic MR-signal alterations of the osseous structures of the pelvic ring. Further assessment with bone scan/SPECT/PET/CT needed to assess for metastatic disease.  3) No evidence of seminal vesicles infiltration.  \n", "treatment_": "No surgery, patient received radiation theraphy after ADT"}, {"dicom_patient_id": "ProstateDx-01-0017", "source_batch": 0, "tcia_id": "ProstateDx-01-0017", "path_report_biopsy": "The specimen consists of multiple core fragments of tan soft tissue measuring 1.4cm to 2.1cm in length and 0.1cm in diameter.  The specimen is submitted in six cassettes. 1-right pz, 2-right pz/tz, 3-right apex, 4-left pz, 5-left pz/tz, 6-left apex. PROSTATE 1.  RIGHT PZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 4+3=7/10, INVOLVING TWO OF TWO CORES, INVOLVING APPROXIMATELY 80% OF THE TISSUE SUBMITTED. 2.  RIGHT PZ/TZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 4+3=7/10, INVOLVING TWO OF TWO CORES, INVOLVING APPROXIMATELY 90% OF THE TISSUE SUBMITTED. 3.  RIGHT APEX: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 4+3=7/10, INVOLVING TWO OF TWO CORES, INVOLVING APPROXIMATELY 60% OF THE TISSUE SUBMITTED. 4.  LEFT PZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, INVOLVING TWO OF TWO CORES, INVOLVING APPROXIMATELY 20% OF THE TISSUE SUBMITTED. 5.  LEFT PZ/TZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, INVOLVING TWO OF TWO CORES, INVOLVING 20% OF THE TISSUE SUBMITTED. 6.  LEFT APEX: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, INVOLVING TWO OF TWO CORES, INVOLVING APPROXIMATELY 15% OF THE TISSUE SUBMITTED.", "path_prostate_specimen": "", "mri_report": "FINDINGS:  The prostate has a maximal lateral diameter of  5.5 cm, a maximal craniocaudal diameter of 3.7 cm and a maximal AP diameter of 3.9 cm resulting in an estimated gland volume of 41 cc. The zonal anatomy is preserved.  Due to an enlarged right central gland the midline deviated to the left. There is a large right central gland tumor seen in the mid third and apical third of the prostate, involving on several levels nearly the entire right lobe. There is midline deviation with deviation and  partial compression of the prostatic urethra. There is bulging towards the right inner obturator muscle. The tumor extends into the right posterior lateral and posterior peripheral zones bilateral.  (at the midthird and apical level of the prostate). The tumor further extends anteriorly into the fibro-muscular band. At the right apex there is asymmetric suspiciously enhancing prostate tissue measuring 1.4 x 1.2 cm in transverse plane , highly suspicious for extraglandular extension.  No evidence for manifest involvement of the neurovascular bundle on either side.   No evidence for seminal vesicles infiltration.  No evidence of involvement of bladder neck and rectal wall.  No suspiciously enlarged obturator and iliac lymph nodes. No MRI evidence for involvement of osseous structures, as far as visualized.         IMPRESSION:  1) Large predominantly right central gland tumor at midthird and apical third of prostate (as detailed above). Findings are suggestive for extracapsular extension at the right anterior lateral apex. (series 401, 601, 605, 606, slice location 21-27; annotations are saved on PACS). 2) No evidence for manifest involvement of the neurovascular bundle on either side.   3) No evidence for manifest seminal vesicles infiltration.   4) No evidence of involvement of bladder neck and rectal wall.  5) No suspiciously enlarged obturator and iliac lymph nodes. 6) No MRI evidence for malignant involvement of osseous structures, as far as visualized. ", "treatment_": "No surgery, patient was recommended casodex, leuprolide and radiation theraphy"}, {"dicom_patient_id": "ProstateDx-01-0018", "source_batch": 0, "tcia_id": "ProstateDx-01-0018", "path_report_biopsy": "The specimen consists of multiple core fragments of tan soft tissue measuring 0.2cm to 1.7cm in length and 0.1cm in diameter.  The specimen is submitted entirely in six cassettes as follows: 1-right PZ, 2-right PZ TZ, 3-right apex, 4-left PZ, 5-left PZ TZ, 6-left apex. –rg PROSTATE BIOPSIES: 1.  RIGHT PZ: PROSTATIC TISSUE, NO TUMOR IDENTIFIED. 2.  RIGHT PZ/TZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, PRESENT IN TWO TISSUE CORES (10% OF TISSUE). PROSTATIC TISSUE, NO TUMOR IDENTIFIED. 3.  RIGHT APEX: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, PRESENT IN TWO TISSUE CORES (30% OF TISSUE). 4.  LEFT PZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, PRESENT IN ONE TISSUE CORE (10% OF TISSUE). 5.  LEFT PZ/TZ: PROSTATIC TISSUE, NO TUMOR IDENTIFIED. 6.  LEFT APEX: MICROSCOPIC FOCUS OF PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, (<1% OF TISSUE). PIN-4 IMMUNOHISTOCHEMISTRY CONFIRMS THE DIAGNOSIS", "path_prostate_specimen": "", "mri_report": "FINDINGS:  The prostate has a maximal lateral diameter of  5.0 cm, a maximal craniocaudal diameter of 4.6 cm and a maximal AP diameter of 3.5 cm resulting in an estimated gland volume of 42 cc. The zonal anatomy is preserved.   There is a 1.6 x 1.2 cm geographic area of hypo intense signal seen on T2-weighed images, with suspicions wash in and wash out on the contrast enhanced dynamic series,   in the right posterior lateral peripheral zone between 6-9 o'clock, with dominant nodule in the mid third of the prostate, which also involves adjacent areas of the central gland. The tumor extends into the base and apical third; at the level of the apical third, there is suspicious enhancement bilateral in the posterior aspects of the gland. There is no evidence of extraglandular extension.  Late enhancement of diffuse centripetal pseudo septations diffuse in the peripheral zones of both sides, suggestive for chronic prostatitis. Nodularity in the central gland suggestive for BPH.    No evidence for involvement of the neurovascular bundle on either side. No evidence for seminal vesicles infiltration.  No evidence of involvement of bladder neck and rectal wall.  No suspiciously enlarged obturator and iliac lymph nodes.     IMPRESSION:  Bilateral Tumor with dominant nodule in the right peripheral zone, in the mid third of the prostate, as detailed above.  No evidence of extraglandular extension. No evidence of seminal vesicle infiltration or involvement of the neurovascular bundle on either side. No pelvic lymphadenopathy. Moderate chronic prostatitis. Moderate BPH.  Incidental note is made of sigma diverticulosis. ", "treatment_": "No surgery, patient was keen on XRT/ADT"}, {"dicom_patient_id": "ProstateDx-01-0019", "source_batch": 0, "tcia_id": "ProstateDx-01-0019", "path_report_biopsy": "The specimen consists of multiple core fragments of brown/tan tissue measuring 0.2cm to 1.5cm in length and 0.1cm in diameter.  The specimen is submitted entirely in seven cassettes.1-right pz, 2-right pz/tz, 3-right apex, 4-left pz, 5-left pz/tz, 6-left apex, 7-floater.-rg  1.  RIGHT PZ: BENIGN PROSTATIC TISSUE, NO TUMOR IDENTIFIED. 2.  RIGHT PZ/TZ: BENIGN PROSTATIC TISSUE, NO TUMOR IDENTIFIED. 3.  RIGHT APEX: BENIGN PROSTATIC TISSUE, NO TUMOR IDENTIFIED. 4.  LEFT PZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 4+4=8/10, INVOLVING 5% OF THE TISSUE EXAMINED. 5.  LEFT PZ/TZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 4+4=8/10, INVOLVING 5% OF THE TISSUE EXAMINED. 6.  LEFT APEX: BENIGN PROSTATIC TISSUE, NO TUMOR IDENTIFIED.\n7.  FLOATER: BENIGN PROSTATIC TISSUE, NO TUMOR IDENTIFIED", "path_prostate_specimen": "Specimen(s) Received  A: RIGHT PELVIC LYMPH NODES  B: LEFT PELVIC LYMPH NODES  C: PROSTATE GLAND   Gross Description   The specimens are received in three containers labeled with the patient' s name, hospital number and A. \"Right Pelvic Lymph Nodes\", B. \"Left Pelvic Lymph Nodes\" and C. \"Prostate Gland\".  Specimen A consists of a 2.5x2.5x2 cm aggregate of fibrofatty tissue from which single whole possible lymph node dissected. The entire specimen is submitted in cassettes as follows: A1  multiple lymph nodes, A2  remaining fibroadipose tissue.  Specimen B consists of a 3x2x0.5 cm aggregate of fibrofatty tissue from which four whole lymph nodes dissected. The entire specimen is submitted in cassettes as follows: B1  three whole lymph nodes, B2  single whole lymph node, B3  remaining fibroadipose tissue.  Specimen C consists of a 38.5 grams, 4x2.5x2 cm radical prostatectomy specimen.  The attached right and left vas measuring 4.5 cm in length by 0.4 cm in diameter, right and left seminal vesicles average 4x3x0.5 cm.  The specimen is inked as follows: right side black, left side blue.  Proximal and distal margins are taken and radial sectioned.  The specimen is transversely sectioned to reveal a vaguely nodular surface.  The entire prostate is submitted in cassettes as follows: C1 and C2  radial section, proximal base of bladder margin, C3 and C4  radial section, distal ureteral margin, C5 thru C8  entire right anterior lobe, distal to proximal, C9 thru C12  entire right posterior lobe, distal to proximal, C13 thru C15  entire left posterior lobe, distal to proximal, C16 thru C18  entire left anterior lobe, distal to proximal, C19  right seminal vesicle and right vas, C20  left seminal vesicle and left vas.\nFinal Diagnosis  A.RIGHT PELVIC LYMPH NODES: SEVEN (7) REACTIVE LYMPH NODES, NO TUMOR IDENTIFIED.  B.LEFT PELVIC LYMPH NODES: TEN (10) REACTIVE LYMPH NODES, NO TUMOR IDENTIFIED.  C.PROSTATE GLAND:    Procedure: Radical Prostatectomy  Prostate Size: 4x2.5x2cm.  Weight: 38.5 grams Lymph Node Sampling: Pelvic lymph node dissection  Histologic Type: Adenocarcinoma (acinar type) Histologic Grade: Gleason Score  Primary Pattern: 4  Secondary Pattern: 4  Total Gleason Score: 4+4=8/10  Tumor Quantitation / Proportion of prostate involved by tumor: Approximately 6%\nExtraprostatic Extension: Not identified  Seminal Vesicle Invasion: Not identified  Margins:  Margins uninvolved by invasive carcinoma  Treatment Effect on Carcinoma: Not identified  Lymph-Vascular Invasion: Not identified  Perineural Invasion: Present  Additional Pathologic Findings: Chronic Inflammation  AJCC Pathologic Staging: (pT2c, pNx, pMx)   pT2c: Bilateral disease  pN0: No regional lymph node metastasis  Specify: Number examined:17 Number involved:0  pMx: Not applicable\nPin-4 and AE1/3 immunostains (on block C13) support the diagnosis of no extraprostatic extension.\nClinical diagnosis and History: Prostate Ca\n\n\n", "mri_report": "FINDINGS:     The prostate gland measures 4.8 (TV) x 3.1 (AP) x 3.3 (CC) cm and the prostate volume measures 25.5 cc.The zonal anatomy of the prostate gland is preserved.   In the base and mid-third of the left posterolateral peripheral zone,  geographic areas of low T2 hypointensity are visualized  from the 4-6 o'clock positions with associated suspicious wash-in and washout genetics on dynamic postgadolinium images. The dominant nodule measures 1.8 (TV) x 0.8 (AP) cm in maximal dimension.  The left posterolateral mass closely approximates the left neurovascular bundle with no definite involvement. No definite extracapsular involvement is seen. Rectum wall and Bladder neck are unremarkable.   Mild benign prostatic hypertrophy and chronic prostatitis are visualized. The seminal vesicles are unremarkable. A small 4 mm round left perirectal lymph node is visualized to adjacent to the left obturator internus (slice location 48, series 601).  No obturator or iliac lymphadenopathy.   No suspicious bone marrow signal abnormalities are seen. Multiplanar reconstructions, subtraction images, and CAD analysis of the dynamic series for assessment of the kinetic information facilitated the interpretation of the exam.   IMPRESSION: \n1. Left posterolateral prostate cancer involving the base and middle third of the gland without evidence of extraglandular disease. No MRI evidence of neurovascular bundle involvement or seminal vesicle involvement. No pelvic lymphadenopathy. 2. Mild benign prostatic hypertrophy and moderate chronic prostatitis. ", "treatment_": "Surgery"}, {"dicom_patient_id": "ProstateDx-01-0020", "source_batch": 0, "tcia_id": "ProstateDx-01-0020", "path_report_biopsy": "The specimen consists of multiple core fragments of tan soft tissue measuring from 0.3cm to 1.8cm in length and 0.1cm in diameter. The specimen is submitted in six cassettes.1-right pz, 2-right pz/tz, 3-right apex, 4-left pz, 5-left pz/tz, 6-left apex.-rg. PROSTATE 1.  RIGHT PZ: PROSTATIC ADENOCARCINOMA, GLEASON GRADE 4+3=7/10, INVOLVING TWO CORES, ABOUT 30% OF TISSUE EXAMINED. 2.  RIGHT PZ/TZ: PROSTATIC ADENOCARCINOMA, GLEASON GRADE 4+3=7/10, INVOLVING TWO CORES, ABOUT 10% OF TISSUE EXAMINED (SEE NOTE). 3.  RIGHT APEX: PROSTATIC ADENOCARCINOMA, GLEASON GRADE 4+3=7/10, INVOLVING TWO CORES, ABOUT 20% OF TISSUE EXAMINED. 4.  LEFT PZ: PROSTATIC ADENOCARCINOMA, GLEASON GRADE 3+3=6/10, INVOLVING ONE CORE, ABOUT 5% OF TISSUE EXAMINED (SEE NOTE). 5.  LEFT PZ/TZ: BENIGN PROSTATIC TISSUE, NO TUMOR IDENTIFIED. 6.  LEFT APEX: PROSTATIC TISSUE WITH MICROSCOPIC FOCUS OF ATYPICAL SMALL ACINAR PROLIFERATION", "path_prostate_specimen": "", "mri_report": "FINDINGS:  Status post TURP. There is a diffuse T2-weighted hypointense signal alterations seen the right peripheral zone and a smaller portion of the right central gland, predominantly in the midthird and base, with suspicious rapid wash in and wash out on the dynamic series. This is suspicious for malignancy.  There is no extracapsular disease seen into the periprostatic tissues. The seminal vesicles show bilateral T2-hypointense signal, which abnormal enhancement on the dynamic series. This is suspicious for seminal vesicles infiltration. No evidence for involvement of the neurovascular bundle on either side.  No evidence of involvement of bladder neck and rectal wall. No suspiciously enlarged obturator and iliac lymph nodes. Multiplanar reconstructions, subtraction images, and CAD analysis of the dynamic series for assessment of the kinetic information facilitated the interpretation of the exam.      IMPRESSION: 1)  Imaging findings suggestive for predominantly right-sided tumor without evidence of extraglandular extension into periprostatic tissues. No involvement of the neurovascular bundles on either side. However, there is abnormal enhancement and abnormal T2-weighted hypointense signal in the seminal vesicles, which is suggestive for seminal vesicles infiltration. No suspiciously enlarged obturator and iliac lymph nodes. 2) Status post TURP;  3) BPH", "treatment_": "No surgery, ADT with RT"}, {"dicom_patient_id": "ProstateDx-01-0021", "source_batch": 0, "tcia_id": "ProstateDx-01-0021", "path_report_biopsy": "Specimen consists of multiple core fragments of tan soft tissue measuring 0.5cm to 1.7cm in length and 0.1cm in diameter.  The specimen is submitted entirely in six cassettes.1-right pz, 2-right pz/tz, 3-right apex, 4-left pz, 5-left pz/tz, 6-left apex.-rg   1.  RIGHT PZ:\nPROSTATIC ADENOCARCINOMA, GLEASON SCORE 4+3=7/10, INVOLVING 80% OF THE TISSUE REPRESENTED.  2.  RIGHT PZ/TZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 4+4=8/10, INVOLVING 60% OF THE TISSUE REPRESENTED.   3.  RIGHT APEX: BENIGN PROSTATIC TISSUE, NO TUMOR IDENTIFIED.   4.  LEFT PZ: BENIGN PROSTATIC TISSUE, NO TUMOR IDENTIFIED.\n5.  LEFT PZ/TZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, INVOLVING 40% OF THE TISSUE REPRESENTED.   6.  LEFT APEX: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, INVOLVING 20% OF THE TISSUE REPRESENTED.  NOTE: PERINEURAL INVASION IS PRESENT. ", "path_prostate_specimen": "Specimen is received fresh and fixed in five containers labeled with the patient name, hospital number and A. Right Pelvic Lymph Nodes, B. Left Pelvic Lymph Nodes, C. Bladder Neck Tissue, D. Left Pedicle and E. Prostate And Seminal Vesicle. Specimen A consists of multiple fragments of yellow fatty tissue measuring 3x3x0.5cm in aggregate with potential lymph nodes measuring from 0.3 to 0.6cm. The specimen is submitted entirely in two cassettes labeled A1 and A2. Specimen B consists of multiple fragments of yellow fatty tissue measuring 2.2x2x0.7cm in aggregate with two potential lymph nodes measuring 0.8 and 0.9cm. The two lymph nodes are submitted in cassette B1 and the remaining fatty tissue submitted in cassette B2.  Specimen C consists of a small fragment of brown soft tissue measuring 0.5x0.2x0.2cm. Specimen is submitted entirely in one cassette labeled C.\nSpecimen D consists of a small fragment of tan soft tissue measuring 0.8x0.4x0.2cm.  Specimen is submitted entirely in a single cassette labeledD.  Specimen E consists of a prostatectomy specimen with attached vas deferens and seminal vesicles weighing 61.1 grams and measuring 4.5x3.4x3.2cm. The right seminal vesicle measures 4x1.8x0.6cm, the left seminal vesicle measures 3.5x1.5x0.5cm. The right vas deferens measures 3.5cm in length x0.3cm in diameter and the left vas deferens measures 3cm in length x0.4cm in diameter. The prostate appears symmetrical and the surface appears intact. The right side is inked black and the left side is inked blue. It is serially sectioned to reveal a distinct yellowish / white nodule in the right posterior lobe measuring 1.2x1x0.9cm. The rest of the parenchyma is somewhat nodular however there are no more distinct nodules identified. The specimen is submitted entirely as follows: cassette E1; vas deferens tips, E2; left urethral margin, radially sectioned, E3; right urethral margin, radially sectioned, E4; left bladder neck margin, radially sectioned, E5; right bladder neck margin, radially sectioned, E6 through E13; right anterior lobe, sectioned from apex to base, E14 through E22; right posterior lobe sectioned from apex to base with the seminal vesicle submitted in cassette E22, E23 through E29; left anterior lobe, sectioned from apex to base, E30 through E37; left posterior lobe sectioned from apex to base with the seminal vesicle submitted in cassette E37.\n Final Diagnosis A.  RIGHT PELVIC LYMPH NODES:SIX (6) REACTIVE LYMPH NODES. NO TUMOR IDENTIFIED. B.  LEFT PELVIC LYMPH NODES:SIX (6) REACTIVE LYMPH NODES. NO TUMOR IDENTIFIED. C.  BLADDER NECK TISSUE: FRAGMENT OF FIBROCONNECTIVE TISSUE.NO TUMOR IDENTIFIED.\nD.  LEFT PEDICLE:FRAGMENT OF FIBROCONNECTIVE TISSUE. NO TUMOR IDENTIFIED.  E.  PROSTATE AND SEMINAL VESICLE:   Procedure:  Radical prostatectomy Prostate Size: 4.5X3.4X3.2 cm Weight: 61.1g Lymph Node Sampling: Pelvic lymph node dissection Histologic Type: Adenocarcinoma (acinar, not otherwise specified) Histologic Grade: Gleason grade 4+3 score = 7/10 Primary pattern: Grade 4 Secondary pattern: Grade 3 Tumor Quantitation: Proportion (percentage) of prostate involved by tumor: 15%  Extraprostatic Extension:  Not identified Seminal Vesicle Invasion: Not identified  Margins: Margins uninvolved by invasive carcinoma  Treatment Effect on Carcinoma: Not identified Lymph-Vascular Invasion: Not identified  Perineural Invasion: Present  Additional Pathologic Findings: High-grade prostatic intraepithelial neoplasia (PIN) and chronic inflammation  Pathologic Staging (pTNM) :  Primary Tumor (pT)  pT2c:     Bilateral disease   Regional Lymph Nodes (pN)  pN0: No regional lymph node metastasis  Specify: Number examined: 12  Number involved: 0  Distant Metastasis (pM: Not applicable  AJCC Pathologic Stage: (pT2c, pN0) \nClinical diagnosis and History: 72 year old male with Prostate cancer.\n", "mri_report": "Indication: patient with Gleason 8 prostate cancer; PSA 15; Preoperative assessment for extraglandular extension and staging.  \nFINDINGS:  The prostate has a maximal lateral diameter of  4.8 cm, a maximal craniocaudal diameter of 3.8 cm and a maximal AP diameter of 2.9 cm resulting in an estimated gland volume of 28 cc. The zonal anatomy is preserved.   Within the midthird of the prostate,  with extension into the apical third on the left and right and left prostate base,  in left and right  posteriorly lateral peripheral zones, there areas of irregular, geographic T-2 weighted high pole intense signal seen, which show along the dynamic contrast-enhanced series suspicious enhancement was rapid wash in and wash out pattern, especially on the right side, the enhancement pattern is suspicious for more aggressive tumor. The left side however shows suspicious enhancement, too.  The dominant nodule on the right side measures 15 x 9 mm on the left side 12 x 7 mm. Capsular infiltration on the right is possible. No manifest extraglandular disease on either side.  No evidence for involvement of the neurovascular bundle on either side. No evidence for seminal vesicles infiltration.  No evidence of involvement of bladder neck and rectal wall.  No suspiciously enlarged obturator and iliac lymph nodes. Multiplanar reconstructions, subtraction images, and CAD analysis of the dynamic series for assessment of the kinetic information facilitated the interpretation of the exam.  \n\nIMPRESSION:  1) Findings suggestive for bilateral cancer in the left and right peripheral zones of right and left base, right and left midthird, and left apical third, as detailed above.  2) No evidence of definite extracapsular disease on either side. Neurovascular bundles and seminal vesicles uninvolved.  3) No local/pelvic lymphadenopathy (up to the aortic bifurcation).", "treatment_": "Surgery"}, {"dicom_patient_id": "ProstateDx-01-0022", "source_batch": 0, "tcia_id": "ProstateDx-01-0022", "path_report_biopsy": "", "path_prostate_specimen": "Gross Description\nThe specimens are received in three containers labeled with the patient' s name, hospital number and A. \"Left Pelvic Lymph Nodes\", B. \"Right Pelvic Lymph Nodes\" and C. \"Prostate Gland\".\nSpecimen A consists of a 4.5x2x0.5 cm single whole fatty lymph node with minimally attached fibroadipose tissue. The lymph node is serially sectioned and the entire specimen is submitted in cassettes as follows: A1 and A2  fatty lymph node, serially sectioned, A3  remaining fibrofatty tissue. Specimen B consists of a 4x2x05. cm piece of fibrofatty tissue from a single whole lymph node dissected which measures 2.5 cm. The entire specimen is submitted in cassettes as follows: B1 and B2  single whole lymph node, serially sectioned, B3  remaining fibrofatty tissue. Specimen C consists of a 42.9 grams, 4x3x2.8 cm radical prostatectomy specimen with bilateral attached vas and seminal vesicles.  The right and left seminal vesicles average 4x1.5x0.4 cm, right and left vas average 3.5 cm in length by 0.3 cm in diameter.  The specimen is inked as follows: right side black, left side blue.  Proximal and distal margins are taken enface and radially sectioned.  The specimen is serially sectioned to reveal a 3x2 cm pale-white, hard mass present in the right posterior and left posterior lobe which grossly abuts the overlying inked margin.  There is focal cystic present in the left anterior lobe.  Representative sections are submitted in cassettes as follows: C1 and C2  radial section, distal urethral margin, C3 and C4  radial section, proximal bladder base margin, C5  right seminal vesicle and right vas, C6  left seminal vesicle and left vas, C7 thru C10  right anterior lobe, inferior to superior, C11 thru C14  right posterior lobe, inferior to superior, C15 thru C18  left posterior lobe, inferior to superior, C19 thru C22  left anterior lobe, inferior to superior. Procedure: Radical Prostatectomy Prostate Size: 4x3x2.8cm. Weight: 42.9g grams Lymph Node Sampling: Pelvic lymph node dissection  Histologic Type: Adenocarcinoma (acinar, not otherwise specified) Gleason Score      Primary Pattern: 4 Secondary Pattern: 4           Total Gleason Score: 4+4=8/10      Tertiary pattern: 3 (Approximately 15% of the tumor volume) Tumor Quantitation / Proportion of prostate involved by tumor: Approximately 65% Extraprostatic Extension: Present      Specify sites: Left posterior and lateral Seminal Vesicle Invasion: Not identified Margins:  Margins involved by invasive carcinoma       Specify sites: Multifocal, Left posterior and lateral margin  Treatment Effect on Carcinoma: Not identified Lymph-Vascular Invasion: Not identified Perineural Invasion: Present Additional Pathologic Findings: Chronic Inflammation AJCC Pathologic Staging (7th ed.): (pT3a, pN0, pMx)   pT3a:     Extraprostatic extension or microscopic invasion of bladder neck pN0:     No regional lymph node metastasis Specify:     Number examined: 2      Number involved: 0 pMx     Not applicable\n", "mri_report": "FINDINGS:  The prostate has a maximal lateral diameter of  4.7 cm, a maximal craniocaudal diameter of 3.4 cm and a maximal AP diameter of 3.1 cm resulting in an estimated gland volume of 29.7 cc. The zonal anatomy is preserved.   In the left peripheral zone involving all 3 levels of the prostate (base, mid third and apex), between 2;00 and 7:00, with involvement of the paramedian right peripheral zone there is a homogeneously hypointense geographic area seen (maximal extension of dominant tumor in the axial plane is 2.8 x 1.2 cm), which shows suspicious wash-in and wash-out kinetics on the dynamic series. The pseudocapsule adjacent to the left neural vascular bundle is irregular and thickened and there is suspicious enhancement seen within the pseudocapsule and with a radial extension of  1 mm there are several small areas of suspicious enhancement extending beyond the pseudocapsule at the left prostate base. In the left apex the tumor reaches the gland borders periurethral. No evidence for involvement of the right neurovascular bundle. No evidence for seminal vesicles infiltration; the tumor reaches up to the left seminal vesicle base, without evidence of direct infiltration. No evidence of involvement of bladder neck and rectal wall.  No suspiciously enlarged obturator and iliac lymph nodes (up to the aortic bifurcation). Incidental note is made of diverticulosis.      IMPRESSION:  Prostate cancer within the left peripheral zone, and to a lesser extent in the paramedian right peripheral zone, involving all three levels of the prostate. Findings are suspicious for beginning extraprostatic extension at the base towards the left neurovascular bundle. (radial extension 1 mm). At the left apex the tumor reaches the gland borders, at the base the tumor reaches the left seminal vesicles base. No without evidence of direct infiltration of seminal vesicles on either side.  No evidence of right neurovascular bundle involvement. No evidence of rectal wall or urinary bladder involvement.  No pelvic lymphadenopathy. ", "treatment_": "Surgery"}, {"dicom_patient_id": "ProstateDx-01-0023", "source_batch": 0, "tcia_id": "ProstateDx-01-0023", "path_report_biopsy": "The specimen consists of multiple core fragments of tan soft tissue measuring 0.3cm to 1.8cm in length and 0.1cm in diameter.  The specimen is submitted in six cassettes.1-right pz, 2-right pz/tz, 3-right apex, 4-left pz, 5-left pz/tz, 6-left apex.-rg PROSTATE 1.  RIGHT PZ: PROSTATIC TISSUE, NO TUMOR IDENTIFIED. 2.  RIGHT PZ/TZ: PROSTATIC TISSUE, NO TUMOR IDENTIFIED. 3.  RIGHT APEX: PROSTATIC TISSUE, NO TUMOR IDENTIFIED. 4.  LEFT PZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, INVOLVING THREE OF MULTIPLE CORE FRAGMENTS, AND APPROXIMATELY 40% OF TISSUE EXAMINED. PERINEURAL INVASION PRESENT. 5.  LEFT PZ/TZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, INVOLVING TWO OF TWO CORES, AND APPROXIMATELY 70% OF TISSUE EXAMINED. PERINEURAL INVASION PRESENT 6.  LEFT APEX: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, INVOLVING ONE OF ONE CORE, AND <5% OF TISSUE EXAMINED", "path_prostate_specimen": "", "mri_report": "FINDINGS:  The prostate has a maximal lateral diameter of  5.3 cm, a maximal craniocaudal diameter of 4.0 cm and a maximal AP diameter of 3.0 cm resulting in an estimated gland volume of 33 cc. The zonal anatomy is preserved.   There is a large 3.3 x 2.5 x 2.7 tumor seen in the left upper third (base) of the prostate with extracapsular extension posterior lateral into the left neurovascular bundle/recto prostatic angle just below the left seminal vesicles. There is manifest seminal vesicle infiltration (1.4 x 1.4 cm) at the left seminal vesicle base. No evidence for involvement of the right neurovascular bundle. No evidence of involvement of bladder neck and rectal wall.  No suspiciously enlarged obturator and iliac lymph nodes; there is a 6 mm rounded very dense left iliac lymph node posterior to the vasa iliaca and superior-lateral to the right seminal vesicles;   This does not meet the size criteria of suspiciously enlarged pelvic lymph nodes. IMPRESSION:   1) 3.3 cm left prostate tumor at the base with manifest (1.4cm) left seminal vesicles infiltration and extraglandular extension into the left recto-prostatic angle at the base.  2) Indeterminate 6 mm left iliac lymph node. ", "treatment_": "No surgery, Casodex, Lupron and XRT"}, {"dicom_patient_id": "ProstateDx-01-0024", "source_batch": 0, "tcia_id": "ProstateDx-01-0024", "path_report_biopsy": "The specimen consists of multiple tan core biopsies measuring in length from 0.8 cm to 2 cm and 0.01 cm in diameter each.  The specimen is submitted in toto in seven cassettes as follows: 1  right PZ, 2  right PZ/TZ, 3  right apex, 4  left PZ, 5  left PZ/TZ, 6  left apex, 7 - floater.   rg-\nPROSTATE 1.  RIGHT PZ: BENIGN PROSTATIC TISSUE, NO TUMOR IDENTIFIED. 2.  RIGHT PZ/TZ: BENIGN PROSTATIC TISSUE, NO TUMOR IDENTIFIED. 3.  RIGHT APEX: BENIGN PROSTATIC TISSUE, NO TUMOR IDENTIFIED. 4.  LEFT PZ: BENIGN PROSTATIC TISSUE, NO TUMOR IDENTIFIED. 5.  LEFT PZ/TZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, INVOLVING 2 OF 2 CORES, 50% OF TISSUE REPRESENTED. PERINEURAL INVASION. 6.  LEFT APEX: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, INVOLVING 1 OF 3 CORES, 50% OF TISSUE REPRESENTED. 7.  FREE FLOATER: BENIGN PROSTATIC TISSUE, NO TUMOR IDENTIFIED ", "path_prostate_specimen": "PROSTATE Gross Description  The specimen is received in a single container labeled with the patient's name, hospital number and \"Prostate\".  The specimen consists of a prostatectomy specimen weighing 35.8 grams and measuring 4.5 cm right to left, 3.2 cm anterior to posterior, and 3.5 cm superior to inferior.  A   stump of left seminal vesicle is present measuring 1.5 x 1 x 0.5 cm.  The left vas deferens is also present measuring 2.5 cm in length and 0.3 cm in diameter.  The right seminal vesicle measures 3.5 x 1 x 0.5 cm and appears complete.  The right vas deferens measures 3 cm in length and 0.3 cm in diameter.  External surface is smooth.  The right side is inked black and the left side is inked blue.  Representative sections are submitted in cassettes as follows: 1  basal margin entirely submitted in sagittal sections, 2 and 3  apical margin entirely submitted in sagittal sections, 4  left seminal vesicle, basal margin and left vas deferens margin, 5  right seminal vesicle, basal margin and right vas deferens margin, 6 thru 12  left anterior lobe entirely submitted, 13 thru 18  left posterior lobe entirely submitted, 19 thru 22  right anterior lobe entirely submitted, and 23 thru 27  right posterior lobe entirely submitted.\nFinal Diagnosis\nPROSTATE (35.8 Grams) :   PROSTATIC ADENOCARCINOMA CONVENTIONAL TYPE. GLEASON GRADE 3+3 SCORE = 6/10. THE TUMOR IS CONFINED TO THE PROSTATE GLAND AND IS BILATERAL WITH PRIMARY INVOLVEMENT OF THE LEFT LOBE. THE TUMOR OCCUPIES 20% OF THE TOTAL GLAND.\nEXTRAPROSTATIC EXTENSION IS NOT NOTED. INVASION OF SEMINAL VESICLES IS NOT IDENTIFIED.\nPERINEURAL INVASION IS PRESENT. LYMPHOVASCULAR SPACE INVASION IS ABSENT. THE SURGICAL MARGINS ARE NEGATIVE. LYMPH NODE SAMPLING: NO LYMPH NODES PRESENT. TREATMENT EFFECT ON CARCINOMA: NOT APPLICABLE. ADDITIONAL PATHOLOGIC FINDINGS: HIGH GRADE PROSTATIC INTRAEPITHELIAL NEOPLASIA, CHRONIC INFLAMMATION AND NECROTIZING GRANULOMAS (Slides 9 and 14). SEE NOTE. AJCC PATHOLOGIC STAGING: (pT2c, pNx, pMx).\nClinical diagnosis and History: PSA 12.7 ng/ml\n", "mri_report": "Regular findings seen within the surgical bed. Multiple surgical clips within the prostatic bed and around the anastomosis. Regular appearance of the anastomosis.  No definite masses seen within the prostatic bed. No foci of suspicious enhancement in and around the prostatic bed. Unremarkable urinary bladder and bladder neck. Small seroma posterior lateral to the right  bladder neck; just superior to the anastomosis.   Remnant left seminal vesicles present Series 601 slice location 69-84. No tumor masses seen within the remnant seminal vesicles or suspicious enhancement,  No suspiciously enlarged obturator and iliac lymph nodes. Several small lymph nodes seen along the iliac vessel, the largest located just below the bifurcation median presacral measuring 8 x 6 mm without MRI visible fatty hilum  ( series 701 slice location 126)  The largest obturator nodes measures 3-4 mm. The visualized osseous structures without evidence of involvement.  IMPRESSION: 1) remnant left seminal vesicles, without evidence of malignancy.   2) No suspicious masses.  3) No enlarged obturator or iliac lymph nodes, with one presacral (median line) lymph node just below the bifurcation measuring 8 x 6 mm, without distinct fatty hilum. This is of uncertain significance.  4) Normal appearance of the prostatic bed and anastomosis, with expected post surgical changes (including a small seroma).  ", "treatment_": "Surgery"}, {"dicom_patient_id": "ProstateDx-01-0025", "source_batch": 0, "tcia_id": "ProstateDx-01-0025", "path_report_biopsy": "", "path_prostate_specimen": "Active surveillance – no bx or surgery as yet; dx in 7 yrs previous with gleason 6, 7 prostate cancer under active surviellence on finasteride for rising PSA.  Most recent PSA in 5.91. ", "mri_report": "The prostate has a maximal lateral diameter of  4.4  cm, a maximal craniocaudal diameter of 4.2 cm and a maximal AP  diameter of 3.0 cm resulting in an estimated gland volume of 29 cc.  The zonal anatomy is preserved. In the left  posterior lateral peripheral zone, mid third of the prostate,  between 4 and 5:00 there is a geographic 9 x 7 mm T2-hypointense  area seen, which shows suspicious wash-in and washout kinetics on  the dynamic series. (slice location 24, image 67, series 1205;  precise location 39 image 14 series 401; please note that the slice  location is not consistent since the patient was repositioned during  the exam). The adjacent neurovascular bundle is not involved. No  evidence of extracapsular extension.    There is the same level  (image 67 series 1205) there is a second  6 x 5 mm area of  suspicious T2- Hypointensity and geographic configuration with  suspicious enhancement seen in the anterior centrum gland anteriorly  paramedian, just posterior to the fibromuscular band.     No evidence for involvement of the neurovascular bundle on either side. No evidence for seminal vesicles infiltration.No evidence of  involvement of bladder neck and rectal wall.    No suspiciously  enlarged obturator and iliac lymph nodes.    IMPRESSION:  1) 7 x 9 mm tumor in the left peripheral zone, midthird  of the prostate.  Possible second small 6 mm focus in the paramedian  right anterior central gland posterior to the fibromuscular band.  2) No evidence of extraglandular disease. Neurovascular bundles  uninvolved.    3) No evidence for seminal vesicles infiltration.     4) No suspiciously enlarged obturator and iliac lymph nodes.", "treatment_": "No surgery"}, {"dicom_patient_id": "ProstateDx-01-0026", "source_batch": 0, "tcia_id": "ProstateDx-01-0026", "path_report_biopsy": "The specimen consists of multiple brown/tan core biopsies measuring in length from 1 cm up to 2 cm and 0.01 cm in diameter each.  The specimen is submitted in toto in six cassettes as follows: 1  right PZ, 2  right PZ/TZ, 3  right apex, 4  left PZ, 5  left PZ/TZ, 6  left apex.  rg- PROSTATE 1.  RIGHT PZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, INVOLVING 2 CORES, 90% OF TISSUE EXAMINED. 2.  RIGHT PZ/TZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 4+3=7/10, INVOLVING 2 CORES, 90% OF TISSUE EXAMINED. 3.  RIGHT APEX: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, INVOLVING 2 CORES, 80% OF TISSUE EXAMINED. 4.  LEFT PZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 4+3=7/10, INVOLVING 2 CORES, 60% OF TISSUE EXAMINED. 5.  LEFT PZ/TZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, INVOLVING 2 CORES, 50% OF TISSUE EXAMINED. 6.  LEFT APEX: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, INVOLVING 2 CORES, 60% OF TISSUE EXAMINED. ", "path_prostate_specimen": "\n", "mri_report": "FINDINGS:   The zonal anatomy is preserved.   There is an aprrox. 2.3 x 1.7 cm mass seen in the right posterior and lateral peripheral zone of the mid third and apex with extension to the base. The mass abuts the obturator muscle and the right neurovascular bundle. Extracapsular extension at the right apex and beginning neurovascular involvement, as well as beginning involvement of the right obturator muscle are possible.  There is a second smaller mass, 0.7  x 1.1 cm,  seen in the left lateral peripheral zone, at the midthird and upper apical third of the prostate No evidence of extraprostatic extension on the left.  No evidence for involvement of the left neurovascular bundle. No evidence for seminal vesicles infiltration.  No evidence of involvement of bladder neck and rectal wall.  No suspiciously enlarged obturator and iliac lymph nodes. Multiplanar reconstructions, subtraction images, and CAD analysis of the dynamic series for assessment of the kinetic information facilitated the interpretation of the exam.     IMPRESSION:  Bilateral cancer, with larger mass on the right, as detailed above.  Extracapsular extension into apex and right neurovascular bundle is possible. Tumor also abuts the right obturator muscle.  No evidence of infiltration of left neurovascular bundle or seminal vesicles. No local pelvic lymphadenopathy. ", "treatment_": "No surgery, ADT with XRT"}, {"dicom_patient_id": "ProstateDx-01-0027", "source_batch": 0, "tcia_id": "ProstateDx-01-0027", "path_report_biopsy": "The specimen consists of multiple brown/tan core biopsies measuring in length from 0.3 cm up to 2 cm and 0.01 cm in diameter each.  The specimen is submitted in toto in six cassettes as follows: 1  right PZ, 2  right PZ/TZ, 3  right apex, 4  left PZ, 5  left PZ/TZ, 6  left apex.  PROSTATIC CORE NEEDLE BIOPSIES:  \n1.  RIGHT PZ PROSTATIC ADENOCARCINOMA, GLEASON SCORE (3+3)=6/10, INVOLVING APPROXIMATELY 15% OF TISSUE REPRESENTED.\n2.  RIGHT PZ/TZ PROSTATIC ADENOCARCINOMA, GLEASON SCORE (3+4) =7/10, INVOLVING APPROXIMATELY 40% OF TISSUE REPRESENTED.\n3.  RIGHT APEX PROSTATIC ADENOCARCINOMA, GLEASON SCORE (3+3) =6/10, INVOLVING APPROXIMATELY 30% OF TISSUE REPRESENTED.\n4.  LEFT PZ PROSTATIC ADENOCARCINOMA, GLEASON SCORE (3+4) =7/10, INVOLVING APPROXIMATELY 30% OF TISSUE REPRESENTED.\n5.  LEFT PZ/TZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE (3+4) =7/10, INVOLVING APPROXIMATELY 40% OF TISSUE REPRESENTED.\n6.  LEFT APEX PROSTATIC ADENOCARCINOMA, GLEASON SCORE (3+4) =7/10, INVOLVING APPROXIMATELY 10% OF TISSUE REPRESENTED.", "path_prostate_specimen": "Gross Description The specimens are received in three containers labeled with the patient' s name, hospital number and A. \"Left Obturator Lymph Node\", B. \"Right Obturator Lymph Node\" and C. \"Prostate and Seminal Vesicles\".\nSpecimen A consists of fibroadipose tissue with lymph nodes measuring 4.5x4x0.8 cm. The lymph nodes are dissected and submitted entirely in a single cassette A1.  The remaining fibroadipose tissue plus one bisected lymph node are submitted in cassette A2.\nSpecimen B consists of fibroadipose tissue with lymph nodes measuring 4x2x0.5 cm. The specimen is submitted entirely in a single cassette labeled B.\nSpecimen C consists of a prostate with attached right and left seminal vesicles and segments of right and left vas deferens.  The specimen weighs 73.3 grams and measures 7.3x7x3.3 cm in greatest dimensions.  The right and left seminal vesicles measure 5x1.8x0.7 cm and 5x1.8x0.6 cm, respectively.  The left vas deferens measures 5.1 cm in length by 0.1 cm in diameter.  The right vas deferens measures 6.8 cm in length and 0.5 cm in diameter.  The right side is inked black and the left side is inked blue.  On examination there is a bulbus protruding at the inferior urethral margin measuring 3.5x2.5x1.4 cm.  The prostate is sectioned at 0.3 cm intervals.  Cross sectioning reveals a prostatic parenchyma which appears greyish/white and nodular with a possible lesion extending into the inferior urethral margin.  Representative sections are submitted in cassettes as follows: C1  urethral margin from the right to left, C2  bladder neck margin from right to left, C3  right seminal vesicle base and proximal tip of vas deferens, C4  left seminal vesicle base and proximal tip of vas deferens, C5 and C6  right posterior prostatic lobe alternate sections submitted from apex to the base, C7 and C8  right posterior bulbus protrusion, C9 thru C12  right posterior prostatic lobe alternate sections submitted from the apex to the base, C13 and C14  left anterior prostatic lobe alternate sections submitted from the apex to the base, C15  left posterior prostatic lobe bulbus protrusion, C16 thru C20  left posterior prostatic lobe alternate sections submitted from the apex to the base.\nFinal Diagnosis:  A.LEFT OBTURATOR LYMPH NODE: FIVE (5) REACTIVE LYMPH NODES, NO TUMOR IDENTIFIED.  B.RIGHT OBTURATOR LYMPH NODE: TWO (2) REACTIVE LYMPH NODES, NO TUMOR IDENTIFIED.  C. PROSTATE AND SEMINAL VESICLES:  \nProcedure: Radical prostatectomy  Prostate Size:   Weight: 73.3g  Size: 7.3X7X3.3cm  Lymph Node Sampling: Pelvic lymph node dissection Histologic Type: Adenocarcinoma  Histologic Grade:\nPrimary Pattern Grade 3  Secondary Pattern Grade 4  Total Gleason Score: 3+4=7/10 Tumor Quantitation:  Proportion (percentage) of prostate involved by tumor: 10% Extraprostatic Extension: Present, Focal  Specify site(s): Right posterior prostatic lobe Seminal Vesicle Invasion:  Not identified Margins: Margins uninvolved by invasive carcinoma. Tumor is at <1 mm from right bladder neck margin Treatment Effect on Carcinoma :  Not identified  Lymph-Vascular Invasion: Not identified Perineural Invasion:  Present  Pathologic Staging (pTNM)  Primary Tumor (pT)\npT2c:     Bilateral disease.  Regional Lymph Nodes (pN)  pNo: No regional lymph node metastasis\nSpecify: Number examined: 7 Number involved: 0  Distant Metastasis (pM)  pMx: Not applicable\nAJCC Pathologic Stage: (pT2c, pNo)   Additional Pathologic Findings: Acute and chronic inflammation. Nodular prostatic hyperplasia  Clinical diagnosis and History: Prostate cancer\n\n", "mri_report": "FINDINGS:  The prostate has a maximal lateral diameter of  5.4 cm, a maximal craniocaudal diameter of  4.8 cm and a maximal AP diameter of 3.1 cm resulting in an estimated gland volume of 42 cc.  There is marked BPH present; there is also a prominent 3.0 x 3.1 cm middle lobe present with protrusion into the bladder neck. The zonal anatomy is preserved. In the midthird of the prostate within the lateral and posterior lateral left peripheral zone there is a geographic area of T2-weighted hypo- intense signal with partial rapid wash in and wash out kinetics on the dynamic series;  the dominant nodule within the left posterior lateral peripheral zone measures approximately 2 x 1 cm.  In the right posterior lateral peripheral zone of the lower mid third/apical third of the prostate there is a second dominant nodule seen in measuring 8 x 9 mm, with suspicious wash in and wash out genetics on the dynamic series and nodular T2-weighted hypointense signal, similar to the nodule in the left peripheral zone.  In addition, there are several small areas of  diffuse hypointense signal alteration on the T2-weighted images with abnormal kinetics seen,\nmostly in the left peripheral zone of base midthird and apical third,  and to a lesser extent in the right peripheral zone,  within areas of hemorrhagic changes caused by the recent biopsy.  There is no evidence of manifest extra-capsular extension or seminal vesicle infiltration. The neurovascular bundles seem not to be involved on either side. There are no suspicious the enlarged obturator or iliac lymph nodes seen on either side. Multiplanar reconstructions, subtraction images, and CAD analysis of the dynamic series for assessment of the kinetic information facilitated the interpretation of the exam.  IMPRESSION:  Bilateral prostate cancer with left sided dominance, without evidence of extraglandular disease, as detailed above.  No MRI evidence of neurovascular bundle involvement on either side. No seminal vesicles involvement.  No pelvic lymphadenopathy.  Marked BPH with prominent  middle lobe.\n", "treatment_": "Surgery"}, {"dicom_patient_id": "ProstateDx-01-0028", "source_batch": 0, "tcia_id": "ProstateDx-01-0028", "path_report_biopsy": "The specimen consists of multiple core fragments of tan soft tissue measuring 0.3cm to 1.5cm in length and 0.1cm in diameter.  The specimen is submitted in seven cassettes.1-right pz, 2-right pz/tz, 3-right apex, 4-left pz, 5-left pz/tz, 6-left apex, 7-free floater.-rg PROSTATE:   1.  RIGHT PZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, INVOLVING 10% OF TISSUE. CHRONIC INFLAMMATION PRESENT. 2.  RIGHT PZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, INVOLVING <1% OF TISSUE. 3.  RIGHT PZ/TZ: FIBROMUSCULAR TISSUE ONLY. 4.  LEFT PZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, INVOLVING 60% OF TISSUE. 5.  LEFT PZ/TZ: FIBROMUSCULAR TISSUE ONLY. 6.  LEFT APEX: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, INVOLVING 5% OF TISSUE. 7.  FLOATER: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, INVOLVING LESS THAN 5% OF TISSUE.        ", "path_prostate_specimen": "The specimen is received fresh in a single container labeled with the patient' s name, hospital number and \"Prostate, Seminal Vesicles and Vas Deferens\".  The specimen consists of a prostate with attached left and right seminal vesicles and segments of vas deferens.  The specimen weighs 48.4 grams and measures 4.5x4x4 cm in greatest dimensions.  The right and left seminal vesicles measures 5x2x0.3 cm and 4x2x0.3 cm, respectively.  The left vas deferens measures 2 cm in length and 0.5 cm in diameter.  The right vas deferens measures 3 cm in length and 0.5 cm in diameter.  The prostate is symmetrical and firm.  The specimen is inked as follows: right aspect black and left aspect blue.  The specimen is serially sectioned to reveal prostatic tissue.  The entire specimen is submitted in thirty cassettes as follows: 1 and 2  apical margin, 3  bladder neck margin, 4 thru 9  right anterior aspect, 10 thru 15  right posterior aspect, 17 thru 21  left anterior aspect, 22 thru 28  left posterior aspect, 29  right vas deferens and seminal vesicle margin, 30  left vas deferens and seminal vesicle margin.\nFinal Diagnosis PROSTATE, SEMINAL VESICLES AND VAS DEFERENS:    Procedure:  Radical prostatectomy  Prostate Size: 4.5x4x4cm  Weight: 48.4g  Lymph Node Sampling: No lymph nodes present  Histologic Type: Adenocarcinoma (acinar, not otherwise specified)  Histologic Grade: 3+4 = 7/10  Primary pattern: Grade 3  Secondary pattern: Grade 4  Tumor Quantitation: Proportion (percentage) of prostate involved by tumor: 15% Extraprostatic Extension:  Not identified\nSeminal Vesicle Invasion: Not identified  Margins: Margins uninvolved by invasive carcinoma\nTreatment Effect on Carcinoma: Not identified  Lymph-Vascular Invasion: Not identified\nPerineural Invasion: Present  Additional Pathologic Findings: High-grade prostatic intraepithelial neoplasia (PIN), acute and chronic inflammation  Pathologic Staging (pTNM)   Primary Tumor (pT)\npT2c:     Bilateral disease  Regional Lymph Nodes (pN)  pNx:     Cannot be assessed\nSpecify: Number examined: 0 Number involved: 0  Distant Metastasis (pM)  Not applicable\nAJCC Pathologic Stage: (pT2c, pN0)   Clinical diagnosis and History: Prostate cancer\n\n\n", "mri_report": "FINDINGS:  The prostate has a maximal lateral diameter of  4.5 cm, a maximal craniocaudal diameter of 3.9 cm and a maximal AP diameter of 3.4  cm resulting in an estimated gland volume of 31 cc. The zonal anatomy is preserved.   Within the prostate base (upper third) with extension into the mid third and apical third there is diffuse T2-weighted signal alteration seen in the posterior  and posterior lateral left peripheral zone and to a lesser extent in the right posterior peripheral zone (paramedian right) between 3 and 7 o'clock. Within these areas there is suspicious contrast enhancement seen, with rapid wash-in and  wash-out pattern.  These findings are suggestive  for bilateral prostate cancer with dominant nodule in the left upper third. The dominant nodule on the left measures 1.7 x 1.1 cm. No evidence for involvement of the neurovascular bundle on either side. No evidence for seminal vesicles infiltration.  No evidence of involvement of bladder neck and rectal wall.  No suspiciously enlarged obturator and iliac lymph nodes. Multiplanar reconstructions, subtraction images, and CAD analysis of the dynamic series for assessment of the kinetic information facilitated the interpretation of the exam.     \nIMPRESSION:  Bilateral prostate cancer with left-sided dominance, without evidence of extraglandular extension. The dominant nodule in the left prostate base measuring  max. 1.7 cm.    No evidence of neurovascular bundle involvement on either side,  or seminal vesicles infiltration.  No pelvic lymphadenopathy on MRI\n", "treatment_": "Surgery"}, {"dicom_patient_id": "ProstateDx-01-0029", "source_batch": 0, "tcia_id": "ProstateDx-01-0029", "path_report_biopsy": "PROSTATE BIOPSY  \nA. LEFT APEX: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 4+3=7/10, INVOLVING ONE CORE, ABOUT 35% OF THE TISSUE SUBMITTED. B. LEFT LATERAL APEX:\nPROSTATIC ADENOCARCINOMA, GLEASON SCORE 4+3=7/10, INVOLVING ONE CORE, ABOUT 5% OF THE TISSUE SUBMITTED.  C. RIGHT APEX:  BENIGN PROSTATIC TISSUE, NO TUMOR IDENTIFIED.\nD. RIGHT LATERAL APEX:  BENIGN PROSTATIC TISSUE, NO TUMOR IDENTIFIED.\nE. LEFT MID:   PROSTATIC ADENOCARCINOMA, GLEASON SCORE 4+3=7/10, INVOLVING ONE CORE, ABOUT 15% OF THE TISSUE SUBMITTED.  F. LEFT LATERAL MID: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 4+3=7/10, INVOLVING ONE CORE, ABOUT 30% OF THE TISSUE SUBMITTED.  G. RIGHT MID:  BENIGN PROSTATIC TISSUE, NO TUMOR IDENTIFIED.\nH. RIGHT LATERAL MID:  BENIGN PROSTATIC TISSUE, NO TUMOR IDENTIFIED.  I. LEFT BASE:  PROSTATIC ADENOCARCINOMA, GLEASON SCORE 4+3=7/10, INVOLVING ONE CORE, ABOUT 40% OF THE TISSUE SUBMITTED.  J. LEFT LATERAL BASE:  PROSTATIC ADENOCARCINOMA, GLEASON SCORE 4+3=7/10, INVOLVING ONE CORE, ABOUT 60% OF THE TISSUE SUBMITTED.  K. RIGHT BASE:\nBENIGN PROSTATIC TISSUE, NO TUMOR IDENTIFIED.  L. RIGHT LATERAL BASE:  BENIGN PROSTATIC TISSUE, NO TUMOR IDENTIFIED.", "path_prostate_specimen": "\n\n", "mri_report": "2.7 cm dominant mass in the left prostate base, in the posterior lateral peripheral zone with imaging findings suggestive of beginning extracapsular extension posterior-posterior-lateral with proximity to the left neurovascular bundle (prostate base). Irregular signal and enhancement of the left seminal vesicle base (adjacent to the primary tumor/dominant mass with in the left prostate base) suggestive of beginning seminal vesicle infiltration.  The seminal vesicles show bilateral atrophy, and do not show regular thin walled fluid filled vesicles on either side. The left seminal vesicles base; the vesicles which are directly superior and adjacent to the tumor within left posterior lateral prostate show suspicious enhancement on the contrast enhanced images. Imaging findings suggestive for seminal vesicles infiltration. No evidence of involvement of bladder neck and rectal wall. No suspiciously enlarged obturator and iliac lymph nodes.", "treatment_": "No surgery, Casodex, ADT and XRT"}, {"dicom_patient_id": "ProstateDx-01-0030", "source_batch": 0, "tcia_id": "ProstateDx-01-0030", "path_report_biopsy": "The specimen consists of multiple brown core biopsies ranging from 0.5cm to 1.7cm in length and 0.1cm in diameter.  The specimen is submitted in seven cassettes.1-right pz, 2-right pz/tz, 3-right apex, 4-left pz, 5-left pz/tz, 6-left apex, 7-floater.-rg PROSTATE 1-right pz,  PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3 + 4 = 7/10, INVOLVING ONE CORE, 50% OF TISSUE. 2-right pz/tz,  PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3 + 4 = 7/10, INVOLVING TWO CORES, 80% OF TISSUE. 3-right apex,  PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3 + 4 = 7/10, INVOLVING TWO CORES, 30% OF TISSUE. 4-left pz,  PROSTATIC ADENOCARCINOMA, GLEASON SCORE 4 + 3 = 7/10, INVOLVING MULTIPLE CORES, 70% OF TISSUE. 5-left pz/tz,  PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3 + 4 = 7/10, INVOLVING TWO CORES, 80% OF TISSUE. 6-left apex,  PROSTATIC ADENOCARCINOMA, GLEASON SCORE 4 + 4 = 8/10, INVOLVING MULTIPLE CORES, 70% OF TISSUE. 7-floater PROSTATIC ADENOCARCINOMA, GLEASON SCORE 4 + 4 = 8/10, INVOLVING ONE CORES, 90% OF TISSUE", "path_prostate_specimen": "", "mri_report": "FINDINGS:  The prostate has a maximal lateral diameter of  4.6 cm, a maximal craniocaudal diameter of 4.6cm and a maximal AP diameter of 3.3 cm resulting in an estimated gland volume of 36 cc. The zonal anatomy is not preserved, due to history of TURP.  There is a large tumor seen involving most of the prostate base, with extension through midthird and apical third, involving the entire left lobe, and most of the right lobe of the prostate at this level and extension into both lobes of the apical third and further extension into the left apex. Imaging findings are suggestive of seminal vesicles infiltration with involvement of the paramedian aspects (base)  the right seminal vesicles. There is tumor extension into the periprostatic fat in the midline (in between the seminal vesicles) Se 401 SL 54-57; Se 301 SL 36-42. No evidence for involvement of the neurovascular bundle on either side. No evidence of involvement of bladder neck and rectal wall.  No suspiciously enlarged obturator and iliac lymph nodes. Multiplanar reconstructions, subtraction images, and CAD analysis of the dynamic series for assessment of the kinetic information facilitated the interpretation of the exam.      IMPRESSION:  1) Large tumor involving approximately 75% of the prostate gland, with extension into left apex.  2) Imaging findings suggestive of manifest seminal vesicles infiltration of the right seminal vesicles base. (Se 401 SL 54-57; Se 301 SL 36-42), and extension into the periprostatic fat tissue between the seminal vesicles (midline).  3) Neuro-vascular bundles not involved.  4) No suspiciously enlarged obturator or iliac lymph nodes", "treatment_": "Post op patient"}, {"dicom_patient_id": "ProstateDx-01-0031", "source_batch": 0, "tcia_id": "ProstateDx-01-0031", "path_report_biopsy": " ", "path_prostate_specimen": "Specimen(s) Received A: RIGHT VAS DEFERENS B: PROSTATE AND SEMINAL VESICLES A.  RIGHT VAS DEFERENS:   SEGMENT OF VAS DEFERENS. NO TUMOR IDENTIFIED. B.  PROSTATE AND SEMINAL VESICLES:   PROSTATIC ADENOCARCINOMA, CONVENTIONAL TYPE. GLEASON GRADE 3+4 SCORE = 7/10. THE TUMOR IS CONFINED TO THE PROSTATE GLAND AND IS BILATERAL WITH PRIMARY INVOLVEMENT OF THE RIGHT LOBE. THE TUMOR OCCUPIES 10% OF THE TOTAL GLAND. EXTRAPROSTATIC EXTENSION NOT NOTED. INVASION OF SEMINAL VESICLES IS NOT IDENTIFIED. PERINEURAL INVASION IS PRESENT. LYMPHOVASCULAR SPACE IS ABSENT. THE SURGICAL MARGINS ARE NEGATIVE. LYMPH NODE SAMPLING:      NO LYMPH NODES PRESENT. TREATMENT EFFECT ON CARCINOMA:  NOT IDENTIFIED ADDITIONAL PATHOLOGIC FINDINGS: HIGH-GRADE PROSTATIC INTRAEPITHELIAL NEOPLASIA, ACUTE AND CHRONIC INFLAMMATION. COMMENT: AJCC PATHOLOGIC STAGING  (pT2c, pNx, pMx.    Gross Description  The specimens are received fresh in two containers labeled with the patient' s name, hospital number and A. \"Right Vas Deferens\" and B. \"Prostate and Seminal Vesicle\".\nSpecimen A consists of a partial segment of the vas deferens measuring 4x0.5 cm.  The tip is inked black and the margin is submitted in a single cassette labeled A.\nSpecimen B consists of a total prostatectomy specimen weighing 51.7 grams and measuring 4.4x4x3.3 cm.  The right seminal vesicle measures 4.5x1.5x0.5 cm.  The left seminal vesicle measures 4.7x0.7x0.5 cm.  The right vas deferens appears incomplete and measures 2.7x0.6 cm.  The left vas deferens measures 5.7x0.6 cm.  The right surface of the prostate is inked black and the left surface is inked blue.  The right and the left lobes appear symmetrical with slight nodularity of both lobes.  The specimen is serially sectioned to reveal an irregular yellowish lesion in the right posterior lobe measuring 0.9x0.4 cm.  There are no other lesions identified.  The specimen is submitted in toto in cassettes as follows: B1  left vas deferens, B2 right apical margin, B3  thru B8  right anterior lobe sectioned from apex to base, B8 right bladder neck margin,  B9  thru B17  right posterior lobe sectioned from apex to base with cassette B17 containing the seminal vesicle and B15 and B16 containing the lesion, B18  left apical margin, B19 thru B23  left anterior lobe sectioned from apex to base,  B24   left bladder neck margin, B25 thru B32  left posterior lobe sectioned from apex to base with cassette B32 containing the seminal vesicle. Final Diagnosis A.RIGHT VAS DEFERENS: SEGMENT OF VAS DEFERENS. NO TUMOR IDENTIFIED.\nB.PROSTATE AND SEMINAL VESICLES:   PROSTATIC ADENOCARCINOMA, CONVENTIONAL TYPE. GLEASON GRADE 3+4 SCORE = 7/10. THE TUMOR IS CONFINED TO THE PROSTATE GLAND AND IS BILATERAL WITH PRIMARY INVOLVEMENT OF THE RIGHT LOBE.  THE TUMOR OCCUPIES 10% OF THE TOTAL GLAND. EXTRAPROSTATIC EXTENSION NOT NOTED.  INVASION OF SEMINAL VESICLES IS NOT IDENTIFIED. PERINEURAL INVASION IS PRESENT. LYMPHOVASCULAR SPACE IS ABSENT.  THE SURGICAL MARGINS ARE NEGATIVE.  LYMPH NODE SAMPLING: NO LYMPH NODES PRESENT.\nTREATMENT EFFECT ON CARCINOMA:  NOT IDENTIFIED  ADDITIONAL PATHOLOGIC FINDINGS: HIGH-GRADE PROSTATIC INTRAEPITHELIAL NEOPLASIA, ACUTE AND CHRONIC INFLAMMATION.\nCOMMENT:AJCC PATHOLOGIC STAGING  (pT2c, pNx, pMx).\n\n\n", "mri_report": "FINDINGS: Regular findings seen within the surgical bed. Multiple surgical clips within the prostatic bed and around the anastomosis. Regular appearance of the anastomosis.  No definite masses seen within the prostatic bed. No foci of suspicious enhancement in and around the prostatic bed. Unremarkable urinary bladder.  No remnant seminal vesicles present.  No suspiciously enlarged obturator and iliac lymph nodes. Several small lymph nodes seen along the iliac vessels bilateral and peri-rectal, non larger than 5 mm. The visualized osseous structures without evidence of involvement. IMPRESSION: No suspicious mass in the prostatic bed. No enlarged obturator or iliac lymph nodes. Normal appearance of the prostatic bed and anastomosis.", "treatment_": "Surgery"}, {"dicom_patient_id": "ProstateDx-01-0032", "source_batch": 0, "tcia_id": "ProstateDx-01-0032", "path_report_biopsy": "Consult with past prostatectomy. At operation 4 yrs ago, Gleason 4+4=8 prostatic adenocarcinoma with bilateral seminal vesicle invasion and extensive perineural invasion. Two right-sided pelvic LNs and two left-sided pelvic LNs were negative, although it seems they contained some sort of hyperplasia. He had a PSA of 0.3 in last yr, and reportedly had one shot of lupron. His PSA in 2 mos later remained 0.3. CT of the A/P on 2 mos ago revealed no evidence of metastases, but noted residual seminal vesicle tissue and scattered subcentimeter pelvic lymph nodes. Repeat PSA on 1 mo ago was 1.9. No further op recomended", "path_prostate_specimen": "", "mri_report": "Regular  surgical bed.  Regular appearance  of the anastomosis.    No definite masses seen within the  prostatic bed. No foci of suspicious enhancement in and around the  prostatic bed. Unremarkable urinary bladder. There are remnant  seminal vesicles present - on both sides.    No suspiciously  enlarged obturator and iliac lymph nodes. The visualized osseous  structures without evidence of metastasis  IMPRESSION: No  suspicious mass. No enlarged obturator or iliac lymph nodes. Normal  appearance of the prostatic bed and anastomosis.   There are  remnant seminal vesicles bilateral.  ", "treatment_": "post op"}, {"dicom_patient_id": "ProstateDx-01-0033", "source_batch": 0, "tcia_id": "ProstateDx-01-0033", "path_report_biopsy": "", "path_prostate_specimen": "The specimen consists of a prostatectomy specimen with attached left and right seminal vesicles and attached segments of the vas deferens.  The specimen weighs 33.5gms and measures 8x4.1x3.8 cm in greatest dimension.  The right and left seminal vesicles measure 3.8x2.6x0.8 cm and 3.1x1.9x0.9 cm, respectively.  The left vas deferens measures 4.5 cm in length and 0.5 cm in diameter.  The right vas deferens measures 4.5 cm in length and 0.4 cm in diameter.  The prostate is symmetrical and firm.  The right side is inked black and he left side is inked blue.  Sectioning reveals no grossly identifiable tumors.  The prostatic parenchyma is gray/white and nodular in appearance.  Representative sections are submitted in cassettes as follows: 1  distal urethral margin, 2  bladder neck margin, 3  left and right vas deferens margins, 4  left seminal vesicle margin, 5  right seminal vesicle margin, 6 thru 10  left anterior lobe sectioned from apex to base, 11 thru 15  left posterior lobe sectioned from apex to base, 16 thru 19  right anterior lobe sectioned from apex to base, 20 thru 22  right posterior lobe sectioned from apex to base.   Specimen(s) Received PROSTATE GLAND\nPROSTATIC ADENOCARCINOMA, CONVENTIONAL-TYPE. GLEASON GRADE 3+4 SCORE = 7/10. THE TUMOR IS CONFINED TO THE PROSTATE GLAND AND IS BILATERAL. THE TUMOR OCCUPIES 10% OF THE TOTAL GLAND. INVASION OF SEMINAL VESICLES IS NOT IDENTIFIED. PERINEURAL INVASION IS PRESENT. LYMPHOVASCULAR SPACE IS ABSENT. THE SURGICAL MARGINS ARE POSITIVE, (LEFT APICAL AND RIGHT MID POSTERIOR). ADDITIONAL PATHOLOGIC FINDINGS: HIGH GRADE PROSTATIC INTRAEPITHELIAL NEOPLASIA, CHRONIC INFLAMMATION. AJCC PATHOLOGIC STAGE II (pt2c, pnx, pmx).\n", "mri_report": "Indication: Patient is status post radical prostatectomy. Now with  rising PSA.  Pre planning examination.   \nFINDINGS:   \nRegular findings seen within the surgical bed. Multiple surgical clips  within the prostatic bed and around the anastomosis. Regular appearance  of the anastomosis.   No definite masses seen within the prostatic bed. No foci of suspicious  enhancement in and around the prostatic bed. Unremarkable urinary  bladder. No remnant seminal vesicles present.   No suspiciously enlarged obturator and iliac lymph nodes. The  visualized osseous structures without evidence of involvement.     \nIMPRESSION: Expected post surgical appearance of the prostatic bed and  anastomosis. No suspicious mass in the surgical bed. No enlarged  obturator or iliac lymph nodes.\n\n", "treatment_": "Surgery"}, {"dicom_patient_id": "ProstateDx-01-0034", "source_batch": 0, "tcia_id": "ProstateDx-01-0034", "path_report_biopsy": "PROSTATE, LEFT BASE: PROSTATE TISSUE, NO TUMOR IDENTIFIED. B.  PROSTATE, LEFT MIDDLE: PROSTATE TISSUE, NO TUMOR IDENTIFIED. C.  PROSTATE, LEFT APEX: PROSTATE TISSUE, NO TUMOR IDENTIFIED. D.  PROSTATE, RIGHT BASE: PROSTATIC ADENOCARCINOMA, GLEASON GRADE 3+3=6/10 INVOLVING ONE BIOPSY CORE (25% OF TISSUE). E.  PROSTATE, RIGHT MIDDLE: PROSTATIC ADENOCARCINOMA, GLEASON GRADE 3+3=6/10 INVOLVING ONE BIOPSY CORE (20% OF TISSUE). F.  PROSTATE, RIGHT APEX: PROSTATE TISSUE, NO TUMOR IDENTIFIED.  \nPROSTATE BIOPSIES (A AND B):   A.  PROSTATE, LEFT, CORE NEEDLE BIOPSIES: PROSTATIC ADENOCARCINOMA, GLEASON GRADE 3+3=6/10 INVOLVING ONE BIOPSY CORE (5% OF TISSUE). IMMUNOPEROXIDASE STAINS (HMWK) AT OUTSIDE HOSPITAL CONFIRMS DX.  B.  PROSTATE, RIGHT, CORE NEEDLE BIOPSIES: ATYPICAL SMALL ACINAR PROLIFERATION. \n", "path_prostate_specimen": "", "mri_report": "The prostate has a maximal lateral diameter of  5.5 cm, a maximal craniocaudal diameter of  4.1 cm and a maximal AP diameter of  3.2 cm resulting in an estimated gland volume of 38 cc. The zonal anatomy is preserved.   There is diffuse linear (centrifugal configured) enhancement throughout the prostate, suggestive for marked chronic prostatitis.  Slightly obscured by the enhancement pattern of the chronic prostatitis, there are several small foci of suspicious enhancement in the mid prostate and prostate base, in the right and left peripheral zone - compatible with small cancer foci. No foci larger than 5 mm. (the largest in the right upper posterior lateral peripheral zone with a max diameter of 5 mm) There is minimal BPH.  No evidence for involvement of the neurovascular bundle on either side. No evidence for seminal vesicles infiltration.  No evidence of involvement of bladder neck and rectal wall.  No suspiciously enlarged obturator and iliac lymph nodes. Diffuse patchy and geographic signal change of the visualized osseus structures on the T1-weighted images (hypo-intense), less likely associated with prostate cancer. Clinical correlation and bone scan recommended for further evaluation. IMPRESSION:  1) Possible multifocal bilateral prostate cancer with small sub 5 mm foci. No evidence of local extraprostatic disease.  2) Marked Chronic prostatitis. 3) Mild BPH. 4) Diffuse patchy and geographic signal change of the visualized osseus structures (pelvic ring, spine) on the T1-weighted images, less likely associated with prostate cancer. Clinical correlation and bone scan recommended for further evaluation.\n \n", "treatment_": "No surgery, active surveillance"}, {"dicom_patient_id": "ProstateDx-01-0035", "source_batch": 0, "tcia_id": "ProstateDx-01-0035", "path_report_biopsy": "specimen consists of multiple core fragments of tan and white tissue measuring in length from 0.1 cm to 1.5 cm and 0.1 cm in diameter each.  The specimen is submitted in toto in six cassettes as follows: 1  right PZ, 2  right PZ/TZ, 3  right apex, 4  left PZ, 5  left PZ/TZ, and 6  left apex. PROSTATE 1.  RIGHT PZ: BENIGN PROSTATIC TISSUE WITH CHRONIC INFLAMMATION. NO TUMOR IDENTIFIED. 2.  RIGHT PZ/TZ: BENIGN PROSTATIC TISSUE WITH CHRONIC INFLAMMATION. NO TUMOR IDENTIFIED. 3.  RIGHT APEX: BENIGN PROSTATIC TISSUE WITH CHRONIC INFLAMMATION. NO TUMOR IDENTIFIED. 4.  LEFT PZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 4+3=7/10, INVOLVING 50% (ONE CORE) OF TISSUE REPRESENTED. 5.  LEFT PZ/TZ: BENIGN PROSTATIC TISSUE WITH CHRONIC INFLAMMATION. NO TUMOR IDENTIFIED. 6.  LEFT APEX: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 4+4=8/10, INVOLVING 30% (ONE CORE) OF TISSUE REPRESENTED.", "path_prostate_specimen": "", "mri_report": "The prostate has a maximal lateral diameter of  6.2 cm, a maximal craniocaudal diameter of 4.7 cm and a maximal AP diameter of 4.3 cm resulting in an estimated gland volume of 65 cc. The zonal anatomy is preserved.  There is BPH.  On the T2-W images there is an area of hypo-intense tissue in the left posterior lateral (4-6 o'clock) Peripheral Zone  Upper and Mid Third of the prostate measuring approximately 2.1 x 1.7 cm.  This area shows highly suspicious contrast enhancement. The capsule in this area is irregular and bulging. On the dynamic series there is suspicious enhancement within the mass, the capsule and beyond the capsule (radial extension 2 mm). The left neurovascular bundle might be infiltrated. (Series 501 slice location 33-42) There is an additional smaller area with hypo intense tissue in the right posterior lateral peripheral zone ( 6-8 o'clock), upper (base) and midthird of the prostate  with suspicious enhancement on the dynamic series. No evidence for involvement of the neurovascular bundle on the right side.   No evidence for seminal vesicles infiltration.  No evidence of involvement of bladder neck and rectal wall.  No suspiciously enlarged obturator and iliac lymph nodes. (the largest iliac lymph nodes are 5 mm - on both sides).       IMPRESSION:  Bilateral Prostate Cancer (left and right peripheral zones) with dominant mass (2 cm) in the left posterior lateral Peripheral Zone (5 o'clock); midthird of the prostate. Findings are suggestive for early extracapsular extension (radial extension 2 mm) at 5 o'clock; midthird of the prostate; with possible involvement of the left neurovascular bundle.  There is no manifest extracapsular extension on the right side. No evidence of Seminal Vesicles infiltration.", "treatment_": "No surgery, Lupron, Caosedx and radiation theraphy"}, {"dicom_patient_id": "ProstateDx-01-0036", "source_batch": 0, "tcia_id": "ProstateDx-01-0036", "path_report_biopsy": "PROSTATE BIOPSIES  A.  PROSTATE (RIGHT PZ), NEEDLE CORE BIOPSY  PROSTATIC TISSUE. NO TUMOR IDENTIFIED. B.  PROSTATE (RIGHT PZ/TZ), NEDDLE CORE BIOPSY: PROSTATIC TISSUE. NO TUMOR IDENTIFIED.   C.  PROSTATE (RIGHT APEX), NEEDLE CORE BIOPSY  PROSTATIC TISSUE. NO TUMOR IDENTIFIED.  D.  PROSTATE (LEFT PZ), NEEDLE CORE BIOPSY  PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4 = 7/10, INVOLVING THREE (3) OF FIVE (5) CORES, APPROXIMATELY 20% OF TISSUE EXAMINED. PERINEURAL INVASION IS IDENTIFIED.  E.  PROSTATE (LEFT PZ/TZ), NEEDLE CORE BIOPSY: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4 = 7/10, INVOLVING ONE (1) OF THREE(3) CORES, LESS THAN 5% OF TISSUE EXAMINED.   F.   PROSTATE (LEFT APEX), NEEDLE CORE BIOPSY: PROSTATIC TISSUE. NO TUMOR IDENTIFIED.", "path_prostate_specimen": "\n", "mri_report": "The prostate has a maximal lateral diameter of  6.5 cm, a maximal craniocaudal diameter of 7.5cm  with prominent median lobe protruding into bladder neck; and a maximal AP diameter of 5.6  cm resulting in an estimated gland volume of 141 cc. The zonal anatomy is preserved, however there is a markedly enlarged central gland with a very large median lobe protruding into the bladder neck, consistent with marked BPH.  There are several small irregular areas of T2-hyperintensity with suspicious contrast enhancement. in the posterior lateral left and right peripheral zone at 4-5 o'clock and 7-8 o'clock, respectively, in the mid and upper third of the prostate.  Capsular infiltration is possible on both sides. Minimal extracapsular extension is more likely on the left side (left posterior lateral peripheral zone; mid third at 5 o'clock).  In addition suspicious area of enhancement in the midthird of the prostate in the right central gland and a small area in the left aspect of the median lobe.  No evidence for involvement of the neurovascular bundle on either side. There is minimal enhancement at the seminal vesicles based on both sides, however, manifest seminal vesicles infiltration is not visualized.  No evidence of involvement of urinary bladder neck and rectal wall. (The lobulated enhancement of the bladder neck  on CT, was caused by the prominent median lobe of the prostate).  No suspiciously enlarged obturator lymph nodes. There is a 10 x 8 mm rounded left iliac lymph node just above level of the upper seminal vesicles and a second 10 x 6 mm lymph node (both just posterior to the left iliac vein.  The lymph nodes do not show a fatty hilum.  Multiplanar reconstructions, subtraction images, and CAD analysis of the dynamic series for assessment of the kinetic information facilitated the interpretation of the exam.      IMPRESSION:  1) Multifocal possible bilateral prostate cancer with capsular infiltration and possible minimal extracapsular extension more likely on the left (ECE possible left posterior lateral). 2) No involvement of the neurovascular bundle on either side.  3) No manifest infiltration of the seminal vesicles. Beginning infiltration of the seminal vesicle basis is possible.  4) No involvement of the bladder neck. 5) Two adjacent 10 mm left iliac lymph nodes  without fatty hilum  posterior/dorsal to the left iliac vein just above the level of the upper aspect of the seminal vesicles) 6) Very large prostate (141 cc) due to marked BPH and large median lobe protruding into the bladder neck. \n", "treatment_": "No surgery, Casodex, leuprolide and RT"}, {"dicom_patient_id": "ProstateDx-01-0037", "source_batch": 0, "tcia_id": "ProstateDx-01-0037", "path_report_biopsy": "", "path_prostate_specimen": "A: PROSTATE AND RIGHT SEMINAL VESICLE B: RIGHT INTERNAL ILIAC AND OBTURATOR NODES C: LEFT INTERNAL ILIAC AND OBTURATOR NODES D: LEFT SEMINAL VESICLE E: BASE OF PROSTATE A.  PROSTATE AND RIGHT SEMINAL VESICLE:   Procedure Radical prostatectomy  Prostate Size:  Weight: 42.1grams Size: 4.2 x 4.1x 4.1 cm  Lymph Node Sampling: Pelvic lymph node dissection  Histologic Type:  Adenocarcinoma (acinar, not otherwise specified)  Histologic Grade:  Primary Pattern: Grade 4 Secondary Pattern Grade 3 Total Gleason Score: 7 Tumor Quantitation:  Proportion (percentage) of prostate involved by tumor: 80% Extraprostatic Extension: Present, Focal. Seminal Vesicle Invasion: Present. Margins Margin(s) involved by invasive carcinoma: Bladder neck Treatment Effect of Carcinoma Not identified Lymph-Vascular Invasion Not identified Perineural Invasion Present Pathologic Staging (pTNM) Primary Tumor (pT) pT3: Extraprostatic extension         pT3b: Seminal vesicle invasion Regional Lymph Nodes (pN) pN0:     No regional lymph node metastasis Specify: Number involved: 0 Distant Metastasis (pM) pMx: Not applicable  Additional Pathologic Findings: High-grade prostatic intraepithelial neoplasia (PIN), Chronic Inflammation. Gross Description A. \"Prostate and Right Seminal Vesicle\", B. \"Right Internal Ilial and Obturator Nodes\", C. \"Left External Iliac and Obturator Nodes\", D. \"Left Seminal Vesicle\" and E. \"Base of Prostate\". Specimen A consists of a prostatectomy specimen weighing 42.1 gms.  The prostate measures 4.2 x 4.1 x 4.1 cm. The right seminal vesicle measures 3.9 x 1.3 x 1.0 cm.  The right vas deferens measures 5.5 in length by 0.5 cm in diameter.  The left vas deferens measures 5.6 cm in length by 0.5 cm in diameter.  The right aspect of the specimen is inked black and the left aspect is inked blue.  The specimen is submitted in toto in cassettes as follows: A1  left vas deferens, A2  right seminal vesicle, A3  bladder margin, A4  apical margin, A5 thru A10  left superior lobe from apical to bladder margin, A11 thru A18  left inferior lobe from apical to bladder margin, A19 thru A25  right inferior lobe from apical to bladder margin, and A26 thru A31  right superior lobe from apical to bladder margin and A32- right vas deferens. Specimen B consists of a segment of fibroadipose tissue measuring 2.5 x 2.5 x 2.5 cm.  Two potential lymph nodes are identified measuring 1.5 x 1.4 x 1.3 cm and 1.4 x 1.2 x 1.2 cm. The specimen is submitted in toto in cassettes as follows: B1  one lymph node bisected, B2  one lymph node bisected, and B3 and B4  remaining fat. Specimen C consists of a fragment of fibroadipose tissue measuring 2.0 x 1.5 x 1.5 cm.  No potential lymph nodes are identified. The specimen is submitted in toto in two cassettes labeled C1 and C2. Specimen D consists of a seminal vesicle measuring 3.0 x 1.5 x 1.0 cm.  Specimen E consists of a fragment of soft tan tissue measuring 1.0 x 0.9 x 0.9 cm.  The specimen is submitted in toto in a single cassette labeled E.   Specimen: A: PROSTATE AND RIGHT SEMINAL VESICLE B: RIGHT INTERNAL ILIAC AND OBTURATOR NODES C: LEFT INTERNAL ILIAC AND OBTURATOR NODES D: LEFT SEMINAL VESICLE E: BASE OF PROSTATE A.  PROSTATE AND RIGHT SEMINAL VESICLE:   Procedure: Radical prostatectomy Prostate Size:  Weight: 42.1grams Size: 4.2 x 4.1x 4.1 cm Histologic Type:  Adenocarcinoma (acinar) Histologic Grade:  Primary Pattern: Grade 4 Secondary Pattern Grade 3 Total Gleason Score: 7 Tumor Quantitation:  Proportion (percentage) of prostate involved by tumor: 80% Extraprostatic Extension: Present, Focal (Left inferior lobe). Seminal Vesicle Invasion:Present (Left seminal vesicle) Margin(s) involved by invasive carcinoma: Bladder neck.  Perineural Invasion Present Pathologic Staging (pTNM) Primary Tumor (pT) pT3: Extraprostatic extension pT3b: Seminal vesicle invasion (left seminal vesicle). Regional Lymph Nodes (pN) pN0:No regional lymph node metastasis. Number examined: 8 Number involved: 0 E.  BASE OF PROSTATE:   PROSTATIC TISSUE WITH ADENOCARCINOMA, GLEASON SCORE: 4+3=7/10.", "mri_report": "Regular findings seen within the surgical bed. Multiple surgical clips within the prostatic bed and around the anastomosis, which obscure (due to expected artifacts) some portions of the surgical bed.  Regular appearance of the anastomosis.  No definite masses seen within the prostatic bed. No foci of suspicious enhancement in and around the prostatic bed. Unremarkable urinary bladder. No remnant seminal vesicles present.  No suspiciously enlarged obturator and iliac lymph nodes. Several small lymph nodes all sub 5 mm seen along the iliac vessels, The there is a perirectal round lymph node on the left at 9 o'clock, which measures 4 mm. The visualized osseous structures without evidence of malignant involvement.  Incidental note is made of Sigma diverticulosis.  IMPRESSION: 1) No manifest residual tumor; no discrete mass.  2) No remnant seminal vesicls.  3) Expected appearance of the prostatic bed and anastomosis (after surgery 6 weeks ago).  4) No enlarged obturator or iliac lymph nodes. Small 4 mm left perirectal lymph node, of unknown significance.   5) Incidental note is made of Sigma diverticulosis.   Radiation therapy is considered. Pre-planning MRI; evaluation for local residual tumor. FINDINGS:   Regular findings seen within the surgical bed. Multiple surgical clips within the prostatic bed and around the anastomosis, which obscure (due to expected artifacts) some portions of the surgical bed.  Regular appearance of the anastomosis. No definite masses seen within the prostatic bed. No foci of suspicious enhancement in and around the prostatic bed. Unremarkable urinary bladder. No remnant seminal vesicles present. No suspiciously enlarged obturator and iliac lymph nodes. Several small lymph nodes all sub 5 mm seen along the iliac vessels, The there is a perirectal round lymph node on the left at 9 o'clock,  which measures 4 mm. (series 401 slice location 78)  The visualized osseous structures without evidence of malignant involvement.  IMPRESSION: 1) No manifest residual tumor; no discrete mass.  2) No remnant seminal vesicals.  3) Expected appearance of the prostatic bed and anastomosis (after surgery 6 weeks ago).  4) No enlarged obturator or iliac lymph nodes. Small 4 mm left perirectal lymph node, of unknown significance. ", "treatment_": "Surgery"}, {"dicom_patient_id": "ProstateDx-01-0038", "source_batch": 0, "tcia_id": "ProstateDx-01-0038", "path_report_biopsy": "No biopsy report available", "path_prostate_specimen": "", "mri_report": "The zonal anatomy is preserved. The prostate measures in the max.  transverse diameter 5.3 cm, and maximal AP diameter 3.8 cm. The max.  cranial caudal diameter is  4.8 cm. This results in an estimated gland volume of 50 cc. There are multiple suspicious geographic areas of hypo intense signal on the T2 weighted images seen scattered throughout the entire prostate,  including in the central gland,  and left and right peripheral zones of both sides and involving base mid third and apex. In these areas  there is also suspicious  rapid wash-in and wash-out seen on the dynamic contrast enhanced series. A indistinct or partially thickened and irregular pseudo-capsule is seen on the T2 weighted images between the 7 and 8 o'clock position at school, at the middle 3rd of the prostate towards the right neuro vascular bundle. However there are no manifest tumor mass is seen beyond the capsule; irregularity in morphology and atypical enhancement is seen within the fibro-muscular band. Again no manifest tumor extension beyond the gland borders is seen. No involvement of the left neuro-vascular bundle. No definite involvement of the right neuro-vascular bundle. The seminal vesicles are thin walled  and show regular T2 hyperintense intraluminal signal; no enhancement on the DCE images. There is no pelvic lymphadenopathy seen. IMPRESSION:1. Multifocal bilateral prostate cancer within the central gland and left and right peripheral zones with possible capsular infiltration especially right posterior lateral (7-8 o'clock and anteriorly (11-1 o'clock. No manifest extraprostatic extension. No seminal vesicals infiltration. No pelvic lymphadenopathy .", "treatment_": "No Biopsy and surgery, patient is recommended for surgery"}, {"dicom_patient_id": "ProstateDx-01-0039", "source_batch": 0, "tcia_id": "ProstateDx-01-0039", "path_report_biopsy": "PROSTATE:   1.  RIGHT PZ: PROSTATIC TISSUE, NO TUMOR IDENTIFIED. 2.  RIGHT PZ/TZ: PROSTATIC TISSUE WITH CHRONIC INFLAMMATION. NO TUMOR IDENTIFIED. 3.  RIGHT APEX: PROSTATIC TISSUE WITH CHRONIC INFLAMMATION. NO TUMOR IDENTIFIED. 4.  LEFT PZ: PROSTATIC TISSUE WITH CHRONIC INFLAMMATION. NO TUMOR IDENTIFIED. 5.  LEFT PZ/TZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, INVOLVING 10% OF TISSUE SUBMITTED. 6.  LEFT APEX: STROMAL TISSUE ONLY. NO TUMOR IDENTIFIED.", "path_prostate_specimen": "", "mri_report": "The zonal  anatomy is preserved. Maximal transverse diameter 5.5 cm, maximal AP diameter  3.2 cm, and maximal craniocaudal diameter 3.5  cm. Estimated total gland volume: 32 cc. Within the left central gland nearly occupying the entire left central gland of based and mid 3rd there is a geographic homogeneously hypo intense area seen on the T2 weighted images. This area shows rapid wash in and wash out on the dynamic series and therefore is highly suspicious for prostate cancer; the mass measures 1.8 x 2.2 cm in plane, and crosses the midline;  no evidence of a extra prostatic disease. No evidence of involvement of the neuro vascular bundles on either side. The seminal vesicles are collapsed and therefore the assessment is not optimal. However no evidence of manifest seminal vesicle infiltration. No enlarged obturator or iliac lymph nodes on either side. IMPRESSION: 2.2 cm left central gland mass, crossing the midline ; no evidence of extra prostatic disease. No pelvic lymphadenopathy. ", "treatment_": "No surgery"}, {"dicom_patient_id": "ProstateDx-01-0040", "source_batch": 0, "tcia_id": "ProstateDx-01-0040", "path_report_biopsy": "PROSTATIC CORE NEEDLE BIOPSIES:  1.  RIGHT PZ PROSTATIC ADENOCARCINOMA, 4+3=7/10, INVOLVING APPROXIMATELY 60% OF THE TISSUE SUBMITTED. 2.  RIGHT PZ/TZ: PROSTATIC ADENOCARCINOMA, 4+3=7/10, INVOLVING APPROXIMATELY 80% OF THE TISSUE SUBMITTED. 3.  RIGHT APEX: PROSTATIC ADENOCARCINOMA, 4+3=7/10, INVOLVING APPROXIMATELY 80% OF THE TISSUE SUBMITTED. 4.  LEFT PZ: PROSTATIC ADENOCARCINOMA, 3+4=7/10, INVOLVING APPROXIMATELY 20% OF THE TISSUE SUBMITTED. 5.  LEFT PZ/TZ: PROSTATIC TISSUE. NO TUMOR IDENTIFIED. 6.  LEFT APEX: PROSTATIC TISSUE. NO TUMOR IDENTIFIED.", "path_prostate_specimen": "", "mri_report": "The zonal anatomy is preserved. Maximal craniocaudal diameter is 3.8  cm. Maximal AP diameter 2.4 cm and maximal transverse diameter 4.2 cm. Estimated total gland volume approximately 25 cc, including a prominent middle lobe protruding into the bladder neck. The posterior-lateral peripheral zone and adjacent central gland of the mid 3rd base and apex between 6 and 8 o'clock shows suspicious T2  hypointense signal and rapid wash in and wash out on the dynamic  contrast enhanced series. The dominant nodule within the mid 3rd at the junction to the  apical 3rd of the prostate at 7 o'clock  measures 18 x 12 mm the adjacent capsule is regular, without  suspicious signal or enhancement beyond the capsule . Smaller areas  with suspicious T2 hyperintense signal and suspicious contrast  enhancement are seen in the left peripheral zone, mid-third and base  as well as left apex. No evidence of extracapsular extension. No evidence of involvement of the neurovascular bundles on either side. No seminal vesicle infiltration. No suspicious the enlarged obturator or  iliac lymph nodes. IMPRESSION: Bilateral prostate cancer, involving base mid 3rd and apical third of the prostate,  with dominant nodule in the right posterior lateral peripheral zone and adjacent central gland (7-8 o'clock) as described above. Smaller foci also seen on the left side. No evidence of fracture or prosthetic extension no evidence of involvement of the neural vascular bundles on either side or seminal vesicles. No pelvic lymphadenopathy. ", "treatment_": "No surgery"}, {"dicom_patient_id": "ProstateDx-01-0041", "source_batch": 0, "tcia_id": "ProstateDx-01-0041", "path_report_biopsy": "PROSTATE:    1.  RIGHT PZ:PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, INVOLVING <5% OF TISSUE SUBMITTED. 2.  RIGHT PZ/TZ:PROSTATIC TISSUE WITH CHRONIC INFLAMMATION.NO TUMOR IDENTIFIED. 3.  RIGHT APEX: PROSTATIC TISSUE WITH CHRONIC INFLAMMATION. NO TUMOR IDENTIFIED  4.  LEFT PZ: PROSTATIC TISSUE, NO TUMOR IDENTIFIED.  5.  LEFT PZ/TZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, INVOLVING 20% OF TISSUE SUBMITTED. 6.  LEFT APEX: PROSTATIC TISSUE, NO TUMOR IDENTIFIED. 7.  FLOATER: PROSTATIC TISSUE WITH CHRONIC INFLAMMATION. NO TUMOR IDENTIFIED.", "path_prostate_specimen": "", "mri_report": "The zonal anatomy  is preserved,  however there are unusual small \nfluid collections along the surgical capsule suggestive or history of \ncryo-therapy/HIFU. The maximal craniocaudal diameter 3.5 cm, the \nmaximal AP diameter of 3.4 cm and maximal transverse diameter of 4.3  cm resulting in an estimated total gland volume of 27 cc. At the base  and the mid 3rd of the prostate there is a bulging left posterior \nlateral peripheral zone noted, with indistinct capsule towards the \nleft neuro vascular bundle. Beginning involvement of the left knee \nwas in the bundle cannot be excluded however due to the apparent post treatment changes this finding is nonspecific. There are no discrete  tumor masses seen beyond the capsule. There is no suspicious  contrast-enhancement seen beyond the capsule. There is however  suspicious enhancement seen within the left peripheral zone of the  base mid  3rd and apical third between 3 and 6 o'clock, at the mid  3rd level suspicious enhancement crosses the midline and involves the paramedian left and right peripheral zone. The right neural was  combined with is free. The left seminal vesicles show T2 relative  hypo intense and T1 right prior intense signal suggestive or protein  Rich content/ hemorrhage/ amyloidosis. No intraluminal or intramural  nodularity or suspicious enhancement is seen within the seminal  vesicles of the left and right side.  No pelvic lymphadenopathy. IMPRESSION: Predominantly left-sided prostate cancer the posterior-lateral  peripheral zone adjacent to the left neurovascular bundle, without  evidence of manifest extracapsular extension on either side;  however  beginning capsular infiltration cannot be excluded on the background of apparent post treatment changes, suggestive for a history of cryotherapy.   No evidence of involvement of the right neurovascular bundle. Left  hemorrhagic/protein rich seminal vesicles; no evidence of seminal vesicle infiltration on either side. No pelvic lymphadenopathy ", "treatment_": "No surgery, salvage radiation theraphy"}, {"dicom_patient_id": "ProstateDx-01-0042", "source_batch": 0, "tcia_id": "ProstateDx-01-0042", "path_report_biopsy": "PROSTATE CORE NEEDLE BIOPSIES:  1.  RIGHT PZ:PROSTATIC TISSUE WITH CHRONIC INFLAMMATION.  NO TUMOR IDENTIFIED. 2.  RIGHT PZ/TZ:PROSTATIC TISSUE WITH ACUTE AND CHRONIC INFLAMMATION. NO TUMOR IDENTIFIED. 3.  RIGHT APEX:  PROSTATIC TISSUE WITH CHRONIC INFLAMMATION. NO TUMOR IDENTIFIED. 4.  LEFT PZ: FOCAL HIGH GRADE PIN. 5.  LEFT PZ/TZ: PROSTATIC TISSUE. NO TUMOR IDENTIFIED. 6.  LEFT APEX: PROSTATIC TISSUE. NO TUMOR IDENTIFIED.", "path_prostate_specimen": "", "mri_report": "Zonal anatomy is preserved. Maximal transverse diameter 5.1 cm; \nmaximal AP diameter 3.1 cm ; maximal CC diameter 3.5 cm. Estimated total gland volume of 29 cc. The entire prostate including central gland as well as left and right peripheral zone show diffuse T2 hyperintense signal alterations suggestive for diffuse chronic prostatitis. The central gland shows mild BPH. In the left posterior lateral apex, (5-6 o'clock)  the left posterior lateral peripheral zone (4-5 o'clock)  of the mid 3rd of the gland and left lateral peripheral zone (3 o'clock)  of the base as well as the anterior gland in proximity to the fibromuscular band  (10-2 o'clock)  show more geographic hypo intensities on the T2 weighted images suspicious for malignancy. No evidence of extra prostatic extension; no evidence of involvement of the neuro vascular bundle seen on either side. The seminal vesicles are unremarkable. No suspicious the largest obturator or iliac lymph nodes on either side. IMPRESSION:Diffuse chronic prostatitis involving the entire prostate. Mild BPH.  Most suspicious areas for malignancy are seen in the anterior gland in proximity to the fibromuscular band between 10 and 2 o'clock, and in the left lateral and posterior lateral peripheral zone. (as detailed above. Unremarkable neurovascular bundles and seminal vesicles ; no pelvic lymphadenopathy.", "treatment_": "No surgery"}, {"dicom_patient_id": "ProstateDx-01-0043", "source_batch": 0, "tcia_id": "ProstateDx-01-0043", "path_report_biopsy": "", "path_prostate_specimen": "", "mri_report": "FINDINGS: The zonal  anatomy is preserved. In the left lateral and  posterio-lateral peripheral zone from 2-6 o'clock and the adjacent  central gland of the prostate base, mid third, and extending into the  apical third, there is a large geographic T2 hypointense area seen,  with highly suspicious kinetics on the DCE series. Maximal extension  of the dominant mass is 2.5  x 1.8 x 2.4 cm; There are also  suspicious areas seen in the paramedian right peripheral zone and  also the posterior lateral peripheral zone. 6-8 o'clock). At the mid third level the prostate left posterior lateral capsule is  interrupted at 5 o'clock; in the apex between 4 and 5 o'clock the  gland border is irregular or indistinct; In addition,  there is  suspicious enhancement seen beyond the prostate capsule in the  mid-third of the prostate between 3 o'clock and 5 o'clock which is  suggestive for beginning extracapsular disease (towards the left  neurovascular bundle).  The right neurovascular bundle is uninvolved. The seminal vesicles  are unremarkable. No suspicious the enlarged obturator and iliac  lymph nodes on either side.      IMPRESSION: Left sided prostate tumor within the left lateral and posterior  lateral peripheral zone with peripheral to the right paramedian  peripheral zone; with beginning/minimal extracapsular extension left  posterior-lateral towards the left neurovascular bundle;    No involvement of the right neurovascular bundle; no seminal vesicles  infiltration; no pelvic lymphadenopathy.   ", "treatment_": ""}, {"dicom_patient_id": "ProstateDx-01-0044", "source_batch": 0, "tcia_id": "ProstateDx-01-0044", "path_report_biopsy": "", "path_prostate_specimen": "", "mri_report": "FINDINGS: The zonal  anatomy is preserved. In the left lateral and  posterio-lateral peripheral zone from 2-6 o'clock and the adjacent  central gland of the prostate base, mid third, and extending into the  apical third, there is a large geographic T2 hypointense area seen,  with highly suspicious kinetics on the DCE series. Maximal extension  of the dominant mass is 3.1 x 1.5 x 2.4 cm; in the mid 3rd of the  prostate the tumor crosses the midline and involves also the  posterior lateral upper right peripheral zone. (till 7 o'clock).  At the mid third level the prostate capsule is interrupted at  5  o'clock;  in in the apex of between 4 and 5 o'clock the gland border  is regular or indistinct; in addition there is suspicious enhancement  seen beyond the prostate capsule in the mid-third of the prostate  between 3 o'clock and 5 o'clock which is suggestive for extracapsular  disease (towards the left neurovascular bundle)In addition, there is  also T2-hypointense signal seen beyond the capsule with maximal  radial extension of 3-4 mm (towards the left neurovascular bundle).    The right neurovascular bundle is uninvolved. The seminal vesicles  are unremarkable. No suspicious the enlarged obturator and iliac  lymph nodes on either side.    IMPRESSION: Large predominantly left sided prostate tumor within the left lateral  and posterior lateral peripheral zone with involvement of the  adjacent central gland; and crossing the midline into the right  peripheral zone. Findings are highly suggestive of extracapsular  extension on the left, posterior-lateral towards the left  neurovascular bundle;    No involvement of the right neurovascular bundle; no seminal vesicles  infiltration;  no pelvic lymphadenopathy. Smaller suspicious areas are also seen in the left in the right  peripheral zone between 9 and 8 o'clock; with suspicious enhancement  along the capsule towards the right neurovascular bundle. Beginning  extracapsular disease on the right side, lateral peripheral zone  cannot be excluded.   Final impression: Extensive bilateral tumor, most likely with  extracapsular extension on the left and possible extracapsular  extension on the right. No evidence of seminal vesicle infiltration;  no pelvic lymphadenopathy.", "treatment_": ""}, {"dicom_patient_id": "ProstateDx-01-0045", "source_batch": 0, "tcia_id": "ProstateDx-01-0045", "path_report_biopsy": "Gross Description\nThe specimen is received in formalin in a single container labeled with the patient's name, hospital number and \"Prostate Biopsies\".  The specimen consists of multiple core fragments of tan and white tissue measuring in length from 0.1 cm to 1.5 cm and 0.1 cm in diameter each.  The specimen is submitted in toto in six cassettes as follows: 1  right PZ, 2  right PZ/TZ, 3  right apex, 4  left PZ, 5  left PZ/TZ, and 6  left apex.\nFinal Diagnosis PROSTATE BIOPSIES: 1. RIGHT PZ: BENIGN PROSTATIC TISSUE WITH CHRONIC INFLAMMATION. NO TUMOR IDENTIFIED.  2. RIGHT PZ/TZ:  BENIGN PROSTATIC TISSUE WITH CHRONIC INFLAMMATION. NO TUMOR IDENTIFIED. 3. RIGHT APEX: BENIGN PROSTATIC TISSUE WITH CHRONIC INFLAMMATION. NO TUMOR IDENTIFIED. 4. LEFT PZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 4+3=7/10, INVOLVING 50% (ONE CORE) OF TISSUE REPRESENTED. 5. LEFT PZ/TZ:\nBENIGN PROSTATIC TISSUE WITH CHRONIC INFLAMMATION. NO TUMOR IDENTIFIED. 6. LEFT APEX:\nPROSTATIC ADENOCARCINOMA, GLEASON SCORE 4+4=8/10, INVOLVING 30% (ONE CORE) OF TISSUE REPRESENTED. Clinical diagnosis and History: fPSA (21.7 ng/ml)", "path_prostate_specimen": "", "mri_report": "FINDINGS:  The prostate has a maximal lateral diameter of  6.2 cm, a maximal craniocaudal diameter of 4.7 cm and a maximal AP diameter of 4.3 cm resulting in an estimated gland volume of 65 cc. The zonal anatomy is preserved.  There is BPH. On the T2-W images there is an area of hypo-intense tissue in the left posterior lateral (4-6 o'clock) Peripheral Zone  Upper and Mid Third of the prostate measuring approximately 2.1 x 1.7 cm.  This area shows highly suspicious contrast enhancement. The capsule in this area is irregular and bulging. On the dynamic series there is suspicious enhancement within the mass, the capsule and beyond the capsule (radial extension 2 mm). The left neurovascular bundle might be infiltrated. (Series 501 slice location 33-42) There is an additional smaller area with hypo intense tissue in the right posterior lateral peripheral zone ( 6-8 o'clock), upper (base) and midthird of the prostate  with suspicious enhancement on the dynamic series. No evidence for involvement of the neurovascular bundle on the right side.  No evidence for seminal vesicles infiltration.  No evidence of involvement of bladder neck and rectal wall. No suspiciously enlarged obturator and iliac lymph nodes. (the largest iliac lymph nodes are 5 mm - on both sides). IMPRESSION:  Bilateral Prostate Cancer (left and right peripheral zones) with dominant mass (2 cm) in the left posterior lateral Peripheral Zone (5 o'clock); midthird of the prostate. Findings are suggestive for early extracapsular extension (radial extension 2 mm) at 5 o'clock; midthird of the prostate; with possible involvement of the left neurovascular bundle. There is no manifest extracapsular extension on the right side. No evidence of Seminal Vesicles infiltration.\n", "treatment_": "No surgery, Lupron, Casodex and RT"}, {"dicom_patient_id": "ProstateDx-01-0046", "source_batch": 0, "tcia_id": "ProstateDx-01-0046", "path_report_biopsy": "The specimen consists of multiple brown/tan core biopsies measuring in length from 0.2 cm to 2.3 cm and 0.1 cm in diameter each.  The specimen is submitted in toto in six cassettes as follows: 1  right PZ, 2  right PZ/TZ, 3  right apex, 4  left PZ, 5  left PZ/TZ, AND 6  left apex.PROSTATE BIOPSIES: 1.  RIGHT PZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, INVOLVING <5% (ONE CORE) OF TISSUE REPRESENTED. 2.  RIGHT PZ/TZ: BENIGN PROSTATIC TISSUE. NO TUMOR IDENTIFIED. 3.  RIGHT APEX: BENIGN PROSTATIC TISSUE. NO TUMOR IDENTIFIED. 4.  LEFT PZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, INVOLVING 40% (TWO CORES) OF TISSUE REPRESENTED. 5.  LEFT PZ/TZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, INVOLVING 30% (TWO CORES) OF TISSUE REPRESENTED. PERINEURAL INVASION NOTED. 6.  LEFT APEX: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, INVOLVING 80% (TWO CORES) OF TISSUE REPRESENTED. PERINEURAL INVASION NOTED.", "path_prostate_specimen": "", "mri_report": "The zonal  anatomy is preserved. The prostate measures in its maximal  transverse diameter of 4.5 in its maximal AP diameter 2.3 and max.  CC diameter 3.3 cm. The estimated gland volume is 18 cc. In the mid 3rd of the prostate in the left posterior lateral peripheral zone between 3 and 5 o'clock there is a T2 hypointense geographic area measuring 13 x 13 mm which shows suspicious enhancement in the dynamic series; this should be considered as the dominant nodule. In this location (4-5 o'clock) there is a irregular capsule seen, yet no tumor masses beyond the capsule. The findings are suggestive for capsular infiltration, without manifest extracapsular disease. The left neurovascular bundle is free. There are several smaller suspicious area, also in the right prostate suggestive for focal multifocal disease. The right neurovascular bundle is free;  there is no seminal vesicle infiltration. There is no pelvic lymphadenopathy (no enlarged lymph nodes in the obturator and iliac stations). There is 1 very well circumscribed triangular-shaped sclerosing bone lesion in the iliac in the right iliac bone, unlikely related to prostatic disease. IMPRESSION: Likely bilateral prostate cancer with dominant nodule in the left posterior lateral peripheral zone,  mid 3rd of the prostate, between 3 and 5 o'clock. In this location. findings are suggestive for capsular infiltration, however no evidence of manifest extracapsular disease (on either side). Both neurovascular bundles are uninvolved. No seminal vesicle infiltration. No pelvic lymphadenopathy. ", "treatment_": "No surgery, Casodex, Leuprolide, RT"}, {"dicom_patient_id": "ProstateDx-01-0047", "source_batch": 0, "tcia_id": "ProstateDx-01-0047", "path_report_biopsy": "", "path_prostate_specimen": "", "mri_report": "FINDINGS: Regular findings seen within the surgical bed. Multiple surgical clips within the prostatic bed and around the anastomosis. Regular appearance of the anastomosis. No definite masses seen within the prostatic bed. No foci of suspicious enhancement in and around the prostatic bed. Unremarkable urinary bladder. No remnant seminal vesicles present. No suspiciously enlarged obturator and iliac lymph nodes. No suspicious the enlarged lymph nodes seen along the iliac vessel, or obturator stations. The left femur head shows a rounded T1-W hypo intense circumscribed lesion; a possible smaller lesion of similar signal is seen in the right femur head. Several small areas of signal changes on T2-W and T1 are seen in the pelvic ring. None of the lesions is completely characterized (either in the field of view only on one sequence, or not on contrast enhanced images) Further imaging needed. IMPRESSION:No suspicious mass in the surgical bed; no enlarged obturator or iliac lymph nodes. Normal appearance of the prostatic bed and anastomosis.Suspicious incompletely characterized bone lesions in the pelvic ring (especially left femur head) for which further evaluation is needed with PET/ diagnostic CT or SPECT.", "treatment_": "Post-op"}, {"dicom_patient_id": "ProstateDx-01-0048", "source_batch": 0, "tcia_id": "ProstateDx-01-0048", "path_report_biopsy": "Gross Description: The specimen consists of multiple core fragments of tan soft tissue measuring 1 cm to 2 cm in length and 0.1 cm in diameter.  The specimen is submitted in six cassettes.1-right pz, 2-right pz/tz, 3-right apex, 4-left pz, 5-left pz/tz, 6-left apex.1.  RIGHT PZ:PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, INVOLVING THREE CORES, APPROXIMATELY 80% OF THE TISSUE EXAMINED. 2.  RIGHT PZ/TZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, INVOLVING TWO CORES, APPROXIMATELY 30% OF THE TISSUE EXAMINED. ACUTE AND CHRONIC INFLAMMATION IS NOTED. 3.  RIGHT APEX: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, INVOLVING THREE CORES, APPROXIMATELY 30% OF THE TISSUE EXAMINED. ACUTE AND CHRONIC INFLAMMATION IS NOTED. 4.  LEFT PZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, INVOLVING ONE CORE, APPROXIMATELY 5% OF THE TISSUE EXAMINED. CHRONIC INFLAMMATION IS NOTED. 5.  LEFT PZ/TZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, INVOLVING ONE CORE, LESS THAN 5% OF THE TISSUE EXAMINED. CHRONIC INFLAMMATION IS NOTED. 6.  LEFT APEX: PROSTATIC TISSUE WITH MICROSCOPIC FOCUS OF ATYPICAL SMALL ACINAR PROLIFERATION. CHRONIC INFLAMMATION IS NOTED. ", "path_prostate_specimen": "Gross Description:  A. \"Left Lymph Node Pocket\", B. \"Right Lymph Node Pocket\" and C. \"Prostate and Seminal Vesicles\".  Specimen A consists of a 2.5x2x1 cm aggregate of fibrofatty tissue. The specimen is submitted entirely in two cassettes labeled A1 and A2. Specimen B consists of a 2.4x2x1 cm aggregate of fibrofatty tissue from which a single whole lymph node dissected. The entire specimen is submitted in cassettes as follows: B1  bisected single whole lymph node, B2 and B3  remaining fibroadipose tissue. Specimen C consists of a 57.1 gram, 4x3.5x3 cm radial prostatectomy specimen with attached right and left vas averaging 5 cm in length by 0.3 cm in diameter, right and left seminal vesicles averaging 3.8x1x0.5 cm.  The specimen is inked as follows: right side black, left side blue.  The specimen is transversely sectioned to reveal a vaguely nodular cut surface.  Representative sections are submitted in cassettes as follows: C1 and C2 - radial section, proximal bladder base margin, C3 and C4  radial section, distal urethral margin, C5 thru C8  right anterior lobe, inferior to superior, C9 thru C12  right posterior lobe, inferior to superior, C13 thru C16  left posterior lobe, inferior to superior, C17 thru C20  left anterior lobe, inferior to superior, C21  right vas and right seminal vesicle, C22  left vas and left seminal vesicle.A: LEFT LYMPH NODE POCKET B: RIGHT LYMPH NODE POCKET C: PROSTATE AND SEMINAL VESICLES A.  LEFT LYMPH NODE POCKET:  FIVE (5) REACTIVE LYMPH NODES. NO TUMOR IDENTIFIED. B.  RIGHT LYMPH NODE POCKET:  TWO (2) REACTIVE LYMPH NODES. NO TUMOR IDENTIFIED. C.  PROSTATE AND SEMINAL VESICLES:  Prostate Size: 4x3.5X3cm Weight: 57.1g Histologic Type: Adenocarcinoma Histologic Grade: Primary Pattern Grade 3 Secondary Pattern Grade 4 Tertiary Pattern Grade 5 Total Gleason Score: 3+4=7/10 with focal tertiary Gleason pattern 5 (Less than1%) Approximate Proportion (percentage) of prostate involved by tumor: 40% Extraprostatic Extension:   Not identified Seminal Vesicle Invasion:  Not identified. Margins: Margins uninvolved by invasive carcinoma. Lymph-Vascular Invasion: Not identified. Perineural Invasion:Present. Pathologic Staging (pTNM) Primary Tumor (pT) pT2c:Bilateral disease Regional Lymph Nodes (pN) pNo: No regional lymph node metastasis. Specify:     Number examined: 7 Number involved: 0. AJCC Pathologic Stage:(pT2c, pNo) High grade prostatic intraepithelial neoplasia (PIN.)Chronic inflammation ", "mri_report": "FINDINGS: The zonal anatomy is preserved. Due to BPH with prominent middle lobe of the prostate is enlarged measuring 5 x 4 x 5 cm resulting in an estimated volume of 52 cc There is diffuse signal alteration seen throughout the central gland consistent with BPH. There is a prominent middle lobe; There is also diffuse linear centrifugal signal alteration seen in the peripheral zones, due to chronic prostatitis, which might obscure small cancer foci. There are several sub 5 mm foci of suspicious enhancement seen in the left and right peripheral zones the prostate in all three levels (from base to apical third) . There is no suspicious enhancement of prostate capsule seen. There is no evidence of neural vascular bundle involvement. The folds of the seminal vesicles are thickened possible as consequences of longstanding BPH . Seminal vesicles infiltration therefore cannot be not entirely excluded, however no intraluminal masses seen in the seminal vesicles. Two rounded lymph node seen (12 x 8 and 9 x 11 mm respectively) along the iliac vessels on the right, just at the level and slightly above the right seminal vesicles, lateral to the urinary bladder. In addition several more small lymph nodes on both sides along the iliac vessels. IMPRESSION: Likely bilateral prostate tumor within enlarged prostate was marked BPH , middle lobe and chronic prostatitis. No evidence of extracapsular disease. The seminal vesicles show thickened walls which probably is a result of longstanding BPH. Beginning seminal vesicle infiltration could be obscured by this findings. Two right iliac > 10mm lymph nodes seen as described above, these are suspicious. PET CT recommended.", "treatment_": "Surgery"}, {"dicom_patient_id": "ProstateDx-01-0049", "source_batch": 0, "tcia_id": "ProstateDx-01-0049", "path_report_biopsy": "Gross Description: The specimen is received in formalin in a single container labeled with the patient's name, hospital number and \"Prostate Biopsies\".  The specimen consists of multiple fragments of tan core biopsies measuring in length from 1.0 cm to 2.0 cm and 0.1 cm in diameter each.  The specimen is submitted in toto in seven cassettes as follows: 1  right PZ, 2  right PZ/TZ, 3  right apex, 4  left PZ, 5  left PZ/TZ, 6  left apex, and 7 - floater.   RIGHT PZ: PROSTATIC ADENOCARCINOMA GLEASON SCORE 3+3=6/10 INVOLVING <5% (ONE CORE) OF TISSUE REPRESENTED. 2. RIGHT PZ/TZ: PROSTATIC ADENOCARCINOMA GLEASON SCORE 3+3=6/10 INVOLVING 60% (TWO CORES) OF TISSUE REPRESENTED. 3. RIGHT APEX: BENIGN PROSTATIC TISSUE. NO TUMOR IDENTIFIED. 4. LEFT PZ: PROSTATIC ADENOCARCINOMA GLEASON SCORE 3+3=6/10 INVOLVING 15% (THREE CORES) OF TISSUE REPRESENTED. 5. LEFT PZ/TZ: PROSTATIC ADENOCARCINOMA GLEASON SCORE 3+3=6/10 INVOLVING 20% (ONE CORE) OF TISSUE REPRESENTED. 6. LEFT APEX: FIBROMUSCULAR TISSUE. NO TUMOR IDENTIFIED.7. FLOATER: PROSTATIC ADENOCARCINOMA GLEASON SCORE 3+3=6/10 INVOLVING <5% (ONE CORE) OF TISSUE REPRESENTED.", "path_prostate_specimen": "", "mri_report": "PSA level 20; Extracapsular disease assessment. \nPre-planning MRI  FINDINGS: The prostate measures in the transverse diameter 5 cm, in the AP diameter 3 cm and the CC diameter 3.7 cm. The estimated gland volume therefore approximately 29 cc. Zonal anatomy is preserved. In the left posterior lateral peripheral zone of the apical third of the prostate at 4-5 o'clock, there is a 8 x 11 x 7 mm T2 hypo intense nodule seen Slightly below this nodule 3 mmm more apical, there is a 2nd T2 hypointense more geographic area seen measuring 13 x 5 x 4 mm between 5 and 7 o'clock prior median in the posterior peripheral zone. Post areas extends to the capsule however no extension beyond the capsule is seen. No suspicious enhancement beyond the capsule. Both neurovascular bundles are uninvolved. No evidence of seminal vesicle infiltration. No enlarged lymph nodes of the obturator or lilac stations.IMPRESSION: Bilateral prostate cancer predominantly in the lower third (apical) of the prostate, within the left posterio-lateral and bilateral paramedian posterior peripheral zones (from 4-7 o'clock) without evidence of extracapsular disease. No evidence of seminal vesicles infiltration or pelvic lymphadenopathy.", "treatment_": "No surgery, patient wanted to go for RT, treatment plan has to be decided"}, {"dicom_patient_id": "ProstateDx-01-0050", "source_batch": 0, "tcia_id": "ProstateDx-01-0050", "path_report_biopsy": "", "path_prostate_specimen": "No specimen.  initially diagnosed in with Gleason score 3+4=7 prostate adenocarcinoma,.treated with a robotic assisted radical prostatectomy and pelvic lymph node dissection 3 yrs ago.  This revealed GS 3+4=7 moderately differentiated prostate adenocarcinoma, 0/2 LNs positive.  There was no extracapsular extension or seminal vesicle invasion, however multiple margins were positive.  It was a pT2cN0.  His PSA had been 0.1 since that time.  PSA on that date had increased to 0.2, up from 0.1. Repeat recent PSA  was 0.3. ", "mri_report": "FINDINGS: Regular findings seen within the surgical bed. Multiple surgical clips within the prostatic bed and around the anastomosis. Regular appearance of the anastomosis. No definite masses seen within the prostatic bed. No foci of suspicious enhancement in and around the prostatic bed. Unremarkable urinary bladder. No remnant seminal vesicles present. No suspiciously enlarged obturator and iliac lymph nodes. Several small 4-7 mm lymph nodes seen along the iliac vessels bilateral. The visualized osseous structures without evidence of involvement. Multiplanar reconstructions, subtraction images, and CAD analysis of the dynamic series for assessment of the kinetic information facilitated the interpretation of the exam.   IMPRESSION: No evidence of local recurrence or pelvic lymph adenopathy.   No suspicious mass. No suspiciously enlarged obturator or iliac lymph nodes. (Several up to 7 mm lymph nodes along the iliac vessels bilateral are non-specific). Normal appearance of the prostatic bed and anastomosis", "treatment_": "Post-op"}, {"dicom_patient_id": "ProstateDx-01-0051", "source_batch": 0, "tcia_id": "ProstateDx-01-0051", "path_report_biopsy": "PROSTATE BIOPSIES: 1.  RIGHT PZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 4+3=7/10, PRESENT IN 2 CORES AND APPROXIMATELY 70% OF TISSUE SUBMITTED. PERINEURAL INVASION IS PRESENT.  2.  RIGHT PZ/TZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 4+3=7/10, PRESENT IN 3 CORES AND APPROXIMATELY 70% OF TISSUE SUBMITTED. PERINEURAL INVASION IS PRESENT. 3.  RIGHT APEX: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 4+3=7/10, PRESENT IN 4 CORES AND APPROXIMATELY 80% OF TISSUE SUBMITTED. 4.  LEFT PZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, PRESENT IN 1 CORE AND APPROXIMATELY 40% OF TISSUE SUBMITTED. 5.  LEFT PZ/TZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, PRESENT IN 2 CORES AND APPROXIMATELY 50% OF TISSUE SUBMITTED. PERINEURAL INVASION IS PRESENT. 6.  LEFT APEX: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 4+3=7/10, PRESENT IN 2 CORES AND APPROXIMATELY 60% OF TISSUE SUBMITTED. PERINEURAL INVASION IS PRESENT.", "path_prostate_specimen": "\n", "mri_report": "There is a large tumor seen within the right posterior and posterior lateral peripheral zone of the prostate in the mid 3rd, with extension into the apex and the base, involving on some levels nearly the entire right peripheral zone including the lateral horn and part of the adjacent central gland paramedian right, with extension to the fibromuscular band anteriorly. The tumor extends also to the left and involves the posterior and posterior lateral left peripheral zone. Total tumor extension on some levels from 4 o'clock to 11 o'clock. On the right the tumor bulges towards the right neurovascular bundle. However, no more mass seen within the neurovascular bundle / or beyond the pseudo capsule on either side. There is no evidence of manifest vesicle infiltration however beginning at infiltration of the seminal vesicle base cannot be excluded.   There is a prominent middle lobe protruding into the bladder neck.   Due to marked motion artifact evaluation for pelvic lymphadenopathy not possible; CT examination recommended for assessment of the lymph nodes.   IMPRESSION: Large bilateral tumor involving predominantly the right peripheral zone and right central gland; and to a lesser extent the left peripheral zone, with dominant mass in the mid-third, and extension to apex and base (maximal diameter in the axial plane is 4.5 cm). There is bulging towards the right neurovascular bundle at the mid third level however no tumor mass is seen within the neurovascular bundle on either side. No definite seminal vesicle infiltration. Beginning infiltration of the seminal vesicle base cannot be excluded.   CT pelvis examination recommended for assessment of lymphadenopathy. Obtained images are not diagnostic due to marked motion artifact.", "treatment_": "No Surgery, treatment with Degarelix"}, {"dicom_patient_id": "ProstateDx-01-0052", "source_batch": 0, "tcia_id": "ProstateDx-01-0052", "path_report_biopsy": "Biopsy: 1.  RIGHT PZ: PROSTATIC TISSUE WITH FOCAL ATYPICAL SMALL ACINAR PROLIFERATION. 2.  RIGHT PZ/TZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, INVOLVING TWO OF TWO CORES AND 60% OF TOTAL TISSUE. 3.  RIGHT APEX: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, INVOLVING TWO OF TWO CORES AND 50% OF TOTAL TISSUE. 4.  LEFT PZ  PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, INVOLVING TWO OF TWO CORES AND 20% OF TOTAL TISSUE. 5.  LEFT PZ/TZ: BENIGN PROSTATIC TISSUE. 6.  LEFT APEX: BENIGN PROSTATIC TISSUE.", "path_prostate_specimen": "\nPROSTECTOMY SPECIMEN: Specimen(s) Received A: LEFT OBTURATOR LYMPH NODES B: RIGHT OBTURATOR LYMPH NODES C: PROSTATE AND SEMINAL VESICLES  Specimen A consists of a fragment of yellow fatty tissue with multiple lymph nodes measuring 5x3x0.9 cm.  The lymph nodes measure from 0.2 cm to 1.2 cm in greatest dimension.  The largest lymph node measuring 1.2 cm is submitted in cassette A1. The small lymph node is submitted in cassette A2 and the remaining fatty tissue with potential lymph nodes submitted in cassette A3.\nSpecimen B consists of a fragment of yellow fatty tissue with multiple lymph nodes measuring 5.8x2.6x0.5 cm.  The largest lymph node measures 2.1x0.7x0.5 cm. This lymph node is bisected and submitted in cassette B1.  The other lymph nodes and remaining fatty tissue are submitted in cassettes as follows: B2  one lymph node measuring 1.2 cm, B3  multiple smaller lymph nodes measuring from 0.4 cm to 1 cm and B4  remaining fatty tissue with potential lymph nodes. Specimen C consists of a radical prostatectomy specimen with seminal vesicles and vas deferens weighing 59.8 grams and measuring 5x4x3.6 cm.  The right seminal vesicle measures 5x2x0.7 cm and the left seminal vesicle measure 4x2x1 cm.  The right and left vas deferens measure 6.6x0.6 cm and 7.5x0.5 cm, respectively.  The surface of the specimen appears intact with a stitch identified by the surgeon as the false capsular incision site.  The right lobe is inked black and the left lobe is inked blue.  The area with the stitch is inked red.  The specimen is sectioned to reveal a grey/tan and nodular parenchyma.  There is no distinct lesion identified. The specimen is submitted entirely in cassettes as follows: C1  vas deferens tips, C2  right urethral margin, C3 -  left urethral margin, C4  right bladder neck margin, C5  left bladder neck margin, C6  thru C10  right anterior lobe sectioned from apex to base, C11 thru C17  right posterior lobe sectioned from apex to base with cassettes C16 and C17 containing the seminal vesicle, C18 thru C24  left anterior lobe sectioned from apex to base, C25 thru C31  left posterior lobe sectioned from apex to base with the seminal vesicle submitted in cassette C31.Final Diagnosis A.  LEFT OBTURATOR LYMPH NODES:   SIX (6) REACTIVE LYMPH NODES, NO TUMOR IDENTIFIED. B.  RIGHT OBTURATOR LYMPH NODES:  TWELVE (12) REACTIVE LYMPH NODES, NO TUMOR IDENTIFIED. C.  PROSTATE AND SEMINAL VESICLES:   Procedure:  Radical prostatectomy Prostate Size: 5x4x3.6cm\nWeight: 59.8g Lymph Node Sampling: Pelvic lymph node dissection Histologic Type: Adenocarcinoma (acinar, not otherwise specified) Histologic Grade: 3+4 = 7/10  Primary pattern: Grade 3  Secondary pattern: Grade 4\nTumor Quantitation: Proportion (percentage) of prostate involved by tumor: 5% Extraprostatic Extension:  Not identified Seminal Vesicle Invasion: Not identified Margins: Margins uninvolved by invasive carcinoma Treatment Effect on Carcinoma: Not identified Lymph-Vascular Invasion: Not identified Perineural Invasion: Present Additional Pathologic Findings: High-grade prostatic intraepithelial neoplasia (PIN), acute and chronic inflammation Pathologic Staging (pTNM)  Primary Tumor (pT)  pT2c:     Bilateral disease Regional Lymph Nodes (pN) pN0:     No regional lymph node metastasis  Specify:     Number examined: 18 Number involved: 0 Distant Metastasis (pM) Not applicable  AJCC Pathologic Stage: (pT2c, pN0) \n\n\n\n", "mri_report": "The prostate anatomy is preserved.  The central gland shows in the AP age typical heterogeneous signal and nodularity. In the mid 3rd of the prostate, peripheral right peripheral zone posterior lateral between 7 and 9 o'clock there is a geographic hypo intense area seen measuring 1.4 x 1.5 cm, abutting the pseudo capsule, also towards the neurovascular bundle; this mass extends to the base and apex; although there is likely capsular infiltration on the right; there is no tumor mass seen beyond the capsule and the right neural vascular bundle itself seems not to be involved. This area shows suspicious contrast enhancement on the dynamic series.  Smaller areas of similar T2 weighted hypo intense signal and suspicious kinetics are seen in the left posterior lateral peripheral zone. No extraglandular extension on the left.     No evidence of neural vascular bundle involvement on either side; the seminal vesicles are fluid filled and thin walled without evidence of infiltration.     There are no enlarged obturator or internal iliac lymph node seen. The visualized osseous structures are unremarkable.     Incidental note is made of a atrophic right obturator muscles and atrophic left psoas major muscle; both are fatty replaced..     IMPRESSION:  Imaging findings are suggestive for bilateral prostate cancer with dominant nodule in the right posterior lateral peripheral zone of the mid third of the prostate,between 7 and 9 o'clock, measuring 1.5 cm, in this area capsular infiltration likely. However, no manifest extracapsular disease visualized.     No evidence of neural vascular bundle involvement on either side. No seminal vesicle infiltration. No pelvic lymphadenopathy. The visualized osseous structures are unremarkable.  Incidental note is made of an atrophic right obturator and left psoas muscles.  ", "treatment_": "Surgery"}, {"dicom_patient_id": "ProstateDx-01-0053", "source_batch": 0, "tcia_id": "ProstateDx-01-0053", "path_report_biopsy": "PROSTATE BIOPSY:  1.  RIGHT PZ  PROSTATIC ADENOCARCINOMA (GLEASON SCORE 3+3=6/10, INVOLVING ONE CORE AND LESS THAN 2% OF TISSUE. PIN-4 STAIN CONFIRMS DIAGNOSIS. ACUTE AND CHRONIC PROSTATITIS. 2.  RIGHT PZ/TZ: BENIGN PROSTATIC TISSUE WITH ACUTE AND CHRONIC PROSTATITIS  3.  RIGHT APEX: BENIGN PROSTATIC TISSUE WITH CHRONIC PROSTATITIS. 4.  LEFT PZ: BENIGN PROSTATIC TISSUE WITH CHRONIC PROSTATITIS. 5.  LEFT PZ/TZ BENIGN PROSTATIC TISSUE WITH CHRONIC PROSTATITIS. 6.  LEFT APEX: BENIGN PROSTATIC TISSUE WITH ACUTE AND CHRONIC PROSTATITIS.", "path_prostate_specimen": "", "mri_report": "The prostate anatomy is preserved. Maximal transverse diameter of 4.5, maximal AP diameter 2.7, maximal CC diameter 3.9. Estimated gland volume 25 cc. There is signs for the BPH and chronic prostatitis. In the right paramedian posterior peripheral zone of the mid 3rd of the prostate between 6 and 7 o'clock there is an elongated area measuring 9 x 3 mm of up hypointense T2-W signal seen with rapid wash-in and wash-out on the dynamic series. Otherwise, there is only diffuse T2 weighted signal alteration, seen, with perseveration of centrifugal \"pseudo septations\", in general heterogenous signal on T2, with corresponding centrifugal fine linear enhancement, suggestive for chronic prostatitis. No evidence of capsular indication or extra glandular extension. Both neurovascular bundles are uninvolved. No seminal vesicles infiltration. Bilateral there are small morphologically benign appearing lymph node seen along the internal iliac vessels; no evidence of pelvic the lymphadenopathy. IMPRESSION: Prostate cancer on the right, with dominant nodule in the posterior lateral peripheral zone between 6-7 o'clock, mid third of the prostate; on the background of chronic prostatitis small additional foci on the right or on the left cannot be excluded.   There is no capsular infiltration or extraglandular extension. Unremarkable neurovascular bundles (based on imaging findings, bilateral nerve sparing possible). No evidence of seminal vesicle infiltration; no evidence of pelvic lymphadenopathy. ", "treatment_": "No surgery, patient is interested in active surveillance and will follow up in 3 months"}, {"dicom_patient_id": "ProstateDx-01-0054", "source_batch": 0, "tcia_id": "ProstateDx-01-0054", "path_report_biopsy": "specimen consists of multiple tan core biopsies measuring in length from 0.2 cm to 2.2 cm and 0.1 cm in diameter each.  The specimen is submitted in toto in seven cassettes as follows: 1  right PZ, 2  right PZ/TZ, 3  right apex, 4  left PZ, 5  left PZ/TZ, 6  left apex, 7  floaters.  PROSTATE BIOPSIES: 1.  RIGHT PZ:\nPROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, INVOLVING ONE CORE, ABOUT 30% OF TISSUE REPRESENTED. 2.  RIGHT PZ/TZ: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, INVOLVING THREE CORES, ABOUT 20% OF TISSUE REPRESENTED. 3.  RIGHT APEX: PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+4=7/10, INVOLVING ONE CORE, ABOUT 30% OF TISSUE REPRESENTED.  4.  LEFT PZ: PROSTATIC TISSUE WITH MICROSCOPIC FOCUS OF ATYPICAL SMALL ACINAR PROLIFERATION.  5.  LEFT PZ/TZ:  PROSTATIC ADENOCARCINOMA, GLEASON SCORE 3+3=6/10, INVOLVING TWO CORES, ABOUT 10% OF TISSUE REPRESENTED. 6.  LEFT APEX: FIBROCONNECTIVE TISSUE. NO TUMOR IDENTIFIED.  7.  FLOATERS: PROSTATIC TISSUE WITH MICROSCOPIC FOCUS OF ATYPICAL SMALL ACINAR PROLIFERATION.     ", "path_prostate_specimen": "Gross Description\n A. \"Left Pelvic Lymph Node Packet\", B. \"Right Pelvic Lymph Node Packet\" and C. \"Prostate and Seminal Vesicles\". Specimen A consists of a single fragment of adipose tissue measuring 5x2.5x0.5 cm.  One lymph node is identified measuring 2.5x1x0.3 cm. The lymph node is submitted in a single cassette labeled A. Specimen B consists of a single fragment of adipose tissue measuring 3x2.5x0.5 cm.  Two lymph nodes are identified measuring 0.5x0.3x0.2 cm and 2.5x1x0.3 cm. The lymph nodes are submitted in two cassettes labeled B1 and B2. Specimen C consists of a prostatectomy specimen weighing 34.3 grams and measuring 5x3x3 cm.  The seminal vesicles measures 4x1 cm each.  The vas deferens measures 5x0.2 cm each.  The right side of the prostate is inked black and the left side is inked blue.  The prostate is serially sectioned from the apex to the bladder neck revealing granularity cut surface.  The specimen is submitted in cassettes as follows: C1  shaved apex margin, C2  shaved bladder neck margin, C3 thru C6  anterior right prostate, serially sectioned from the apex to the base, C7 thru C13  posterior right prostate, serially sectioned from the apex to the base, C14 thru C17  anterior left prostate, serially sectioned from the apex to the base, C18 thru C23  posterior left prostate, serially sectioned from the apex to the base, C24  right seminal vesicle and vas deferens, C25  left seminal vesicle and vas deferens.\nFinal Diagnosis A.LEFT PELVIC LYMPH NODE PACKET: ONE (1) REACTIVE LYMPH NODE, NO TUMOR IDENTIFIED. B.RIGHT PELVIC LYMPH NODE PACKET: TWO (2) REACTIVE LYMPH NODES, NO TUMOR IDENTIFIED  C.PROSTATE AND SEMINAL VESICLES:   Procedure: Radical prostatectomy Prostate Size:  Weight: 34.3gms  Size: 5x3x3cm Lymph Node Sampling: Pelvic lymph node dissection  Histologic Type: Adenocarcinoma (acinar, not otherwise specified) Histologic Grade: Primary Pattern Grade 3 Secondary Pattern Grade 4 Total Gleason Score: 7 Tumor Quantitation: Proportion (percentage) of prostate involved by tumor: 20%\nExtraprostatic Extension: Not identified Seminal Vesicle Invasion: Not identified Margins: Margins uninvolved by invasive carcinoma Treatment Effect on Carcinoma: Not identified Lymph-Vascular Invasion: Not identified Perineural Invasion: Present Pathologic Staging (pTNM) Primary Tumor (pT)  pT2c:Bilateral disease  Regional Lymph Nodes (pN)  pN0:No regional lymph node metastasis  Specify:Number examined: 3 Number involved: 0  Distant Metastasis (pM)  Not applicable Additional Pathologic Findings: High grade prostatic intraepithelial neoplasia (PIN), and chronic inflammation  AJCC Pathologic Stage: (pT2c, pN0)   Clinical diagnosis and History: PSA 6.6\n\n\n", "mri_report": "Normal prostate anatomy is preserved. Imaging findings suggestive for chronic prostatitis and BPH.  The prostate shows on both sides within the posterior lateral peripheral zones (mid third) smaller areas of signal alteration in geographic configuration and abnormal enhancement on the dynamic images. The largest area on the left posterior lateral zone measures 9 x 7 mm on the right 5 x 6 mm. The prostate pseudo capsule on either side are normal.     There is no evidence of capsular infiltration, or extra glandular extension on either side. There is no evidence of seminal vesicle infiltration. There is no evidence of pelvic lymphadenopathy.  IMPRESSION:  Imaging findings suggestive for bilateral prostate cancer with smaller nodules on both sides. No evidence of extra glandular extension or neurovascular bundles involvement. Based on these imaging results nerve sparing would be possible on both sides.  No Seminal vesicles infiltration; no pelvic lymphadenopathy.  Chronic prostatitis.  BPH.        ", "treatment_": "Surgery"}]}